<div><span> </span><h1><strong><span>&#x4E00;&#x3001;&#x524D;&#x8A00;</span></strong></h1><p><span>&#x5728;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x5B8C;&#x4E86; <a href="http://www.wjdiankong.cn/%E5%B8%A6%E4%BD%A0%E5%BC%80%E5%8F%91%E4%B8%80%E6%AC%BE%E7%BB%99apk%E4%B8%AD%E8%87%AA%E5%8A%A8%E6%B3%A8%E5%85%A5%E4%BB%A3%E7%A0%81%E5%B7%A5%E5%85%B7icodetools%E5%BC%80%E5%87%BF%E7%AF%87/" target="_blank">&#x81EA;&#x52A8;&#x7ED9;apk&#x4E2D;&#x6CE8;&#x5165;&#x65E5;&#x5FD7;&#x4EE3;&#x7801;&#x5DE5;&#x5177;icodetools&#x539F;&#x7406;&#x4E86;</a>&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#x5176;&#x5B9E;&#x79BB;&#x771F;&#x6B63;&#x7684;&#x53EF;&#x4F7F;&#x7528;&#x4EF7;&#x503C;&#x6709;&#x70B9;&#x8DDD;&#x79BB;&#xFF0C;&#x672C;&#x7BC7;&#x5C31;&#x5BF9;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#xFF0C;&#x8BA9;&#x5176;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x5F00;&#x59CB;&#x80FD;&#x5DE5;&#x4F5C;&#x91CF;&#x4EA7;&#x3002;&#x5F53;&#x65F6;&#x5728;&#x524D;&#x9762;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x8BF4;&#x5230;&#x9057;&#x7559;&#x7684;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#xFF1A;</span></p><p><span><strong>&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</strong><span><strong>&#x5BF9;&#x6BCF;&#x4E2A;&#x7C7B;&#x4E2D;&#x90FD;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x6253;&#x5370;&#x65B9;&#x6CD5;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;&#x6709;&#x4E9B;&#x5E94;&#x7528;&#x7684;dex&#x8FC7;&#x5927;&#xFF0C;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x4E86;&#x95EE;&#x9898;</strong></span></span></p><p><span><strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</strong><span><strong>&#x5728;&#x4ECE;&#x8F93;&#x5165;&#x4E00;&#x4E2A;apk&#x5230;&#x7ED9;&#x6BCF;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x4EE3;&#x7801;&#x7136;&#x540E;&#x5728;&#x7B7E;&#x540D;&#x8F93;&#x51FA;&#x6700;&#x7EC8;&#x7684;apk&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x90FD;&#x662F;&#x624B;&#x52A8;&#x7684;&#x53BB;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x8FD8;&#x5F97;&#x89E3;&#x51B3;&#x4E00;&#x952E;&#x5316;&#x95EE;&#x9898;</strong></span></span></p><p><span><strong>&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</strong><span><strong>&#x5728;&#x5B9E;&#x9645;&#x6F14;&#x7EC3;&#x4E2D;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x7684;app&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x5BFC;&#x81F4;&#x548B;&#x4EEC;&#x6253;&#x5370;&#x7684;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x8FC7;&#x591A;&#x9738;&#x5C4F;&#xFF0C;&#x5F88;&#x96BE;&#x5B9A;&#x4F4D;&#x5230;&#x6211;&#x4EEC;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x7684;&#x90A3;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x8C03;&#x7528;&#x6B21;&#x6570;&#x8FC7;&#x591A;&#x4F1A;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x51FA;&#x73B0;&#x65E0;&#x54CD;&#x5E94;&#x72B6;&#x6001;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5F97;&#x505A;&#x4E00;&#x4E2A;&#x5F00;&#x5173;&#x548C;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;</strong></span></span></p><p><span>&#x53EA;&#x6709;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x548B;&#x4EEC;&#x624D;&#x7B97;&#x662F;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7ECF;&#x5386;&#x5404;&#x79CD;app&#x7684;&#x8003;&#x9A8C;&#x3002;</span></p><h1><span>&#x4E8C;&#x3001;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x4E86;&#x95EE;&#x9898;&#x4FEE;&#x590D;</span></h1><p><span>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5728;&#x524D;&#x4E00;&#x7BC7;&#x8BB2;&#x89E3;&#x539F;&#x7406;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x6B65;&#x9AA4;&#x6765;&#x8FDB;&#x884C;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5E9E;&#x5927;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x505A;&#x6848;&#x4F8B;&#xFF0C;&#x7ED3;&#x679C;&#x5728;&#x4F7F;&#x7528;dx&#x5C06;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x4EE3;&#x7801;&#x4E4B;&#x540E;&#x7684;jar&#x6587;&#x4EF6;&#x8F6C;&#x5316;&#x6210;dex&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x62A5;&#x9519;&#x4E86;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130104506815?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x6211;&#x4EEC;&#x5C31;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x4EE3;&#x7801;&#x4E4B;&#x540E;&#x7684;jar&#x4E2D;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x8FC7;&#x4E86;&#xFF0C;&#x539F;&#x56E0;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7684;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x64CD;&#x4F5C;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x7C7B;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;dex&#x6587;&#x4EF6;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6DFB;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x76F8;&#x540C;&#x7684;&#x6253;&#x5370;&#x65B9;&#x6CD5;&#xFF0C;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x4E86;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x65B9;&#x6848;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;</span></p><p><span><strong><span>&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#xFF1A;</span></strong>&#x56E0;&#x4E3A;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x4E86;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x88AB;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x6253;&#x5370;&#x5806;&#x6808;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x548B;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x62F7;&#x8D1D;&#x5230;&#x539F;&#x6765;&#x7C7B;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x524D;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x5F88;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#x975E;&#x5E38;&#x591A;&#x7684;&#x540C;&#x6837;&#x4EE3;&#x7801;&#x3002;&#x6700;&#x540E;&#x4F7F;&#x7528;dx&#x8F6C;&#x5316;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x53D1;&#x73B0;&#x4E5F;&#x662F;&#x62A5;&#x9519;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8BE5;&#x65B9;&#x6848;&#x4E0D;&#x53EF;&#x884C;&#x3002;</span></p><p><span><strong><span>&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6848;&#xFF1A;</span></strong>&#x56E0;&#x4E3A;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x90A3;&#x4E2A;&#x6253;&#x5370;&#x5806;&#x6808;&#x7684;&#x65B9;&#x6CD5;&#x80AF;&#x5B9A;&#x4E0D;&#x80FD;&#x8981;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4E0D;&#x80FD;&#x628A;&#x4EE3;&#x7801;&#x90FD;&#x585E;&#x5230;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x524D;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x6B63;&#x5E38;&#x7684;&#x7F16;&#x7801;&#x4E60;&#x60EF;&#x662F;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x6253;&#x5370;&#x65B9;&#x6CD5;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#x4E2D;&#x3002;&#x4ECE;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x662F;&#x9760;&#x8C31;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x53EA;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#x5305;&#x542B;&#x4E86;&#x6253;&#x5370;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x603B;&#x4F53;&#x6765;&#x770B;&#x65B9;&#x6CD5;&#x6570;&#x662F;&#x6CA1;&#x591A;&#x5927;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#x3002;</span></p><p><span>&#x6709;&#x4E86;&#x65B9;&#x6848;&#xFF0C;&#x548B;&#x4EEC;&#x5C31;&#x5F97;&#x5B9E;&#x73B0;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x66F2;&#x6298;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x65B9;&#x6848;2&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9;dex&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;ClassVisitor&#x7C7B;&#x64CD;&#x4F5C;dex&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7C7B;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x8FC7;MethodVisitor&#x7C7B;&#x64CD;&#x4F5C;dex&#x4E2D;&#x6BCF;&#x4E2A;&#x7C7B;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x9014;&#x5F84;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x548B;&#x4EEC;&#x5F97;&#x53E6;&#x60F3;&#x529E;&#x6CD5;&#x4E86;&#x3002;</span></p><p><span>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x80FD;&#x591F;&#x5F80;dex&#x4E2D;&#x585E;&#x5165;&#x4E00;&#x4E2A;&#x7C7B;&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x6848;&#xFF1A;</span></p><p><span><strong><span>&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#xFF1A;</span></strong>&#x975E;&#x5E38;&#x6E05;&#x695A;dex&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x624B;&#x52A8;&#x7684;&#x6DFB;&#x52A0;&#x7C7B;&#x4FE1;&#x606F;&#x5230;dex&#x4E2D;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x6211;&#x53EA;&#x662F;&#x6562;&#x60F3;&#x4E00;&#x60F3;&#xFF0C;&#x5B9E;&#x8DF5;&#x7684;&#x8BDD;&#x6211;&#x5C31;&#x7B97;&#x4E86;&#xFF0C;&#x5F88;&#x7B80;&#x5355;&#x56E0;&#x4E3A;&#x6211;&#x6015;&#x9EBB;&#x70E6;&#xFF01;</span></p><p><span><strong><span>&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6848;&#xFF1A;</span></strong>&#x53EF;&#x4EE5;&#x5229;&#x7528;jar&#x5DE5;&#x5177;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x628A;&#x5229;&#x7528;dex2jar&#x628A;dex&#x6DFB;&#x52A0;&#x4EE3;&#x7801;&#x53D8;&#x6210;jar&#x6587;&#x4EF6;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;jar&#x6587;&#x4EF6;&#x89E3;&#x538B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x628A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x63D2;&#x5165;&#x7684;&#x7C7B;&#x653E;&#x5230;&#x8FD9;&#x4E2A;&#x89E3;&#x538B;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x7528;jar&#x547D;&#x4EE4;&#x751F;&#x6210;jar&#x6587;&#x4EF6;&#x3002;&#x6700;&#x7EC8;&#x5728;&#x4F7F;&#x7528;dx&#x547D;&#x4EE4;&#x751F;&#x6210;dex&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x6709;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x9760;&#x8C31;&#x597D;&#x64CD;&#x4F5C;&#x5440;&#x3002;&#x73B0;&#x5728;&#x770B;&#x7740;&#x6709;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x4E0B;&#x9762;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x4E00;&#x952E;&#x5316;&#x5DE5;&#x5177;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x90FD;&#x4E0D;&#x7528;&#x4F60;&#x6765;&#x64CD;&#x4F5C;&#xFF0C;&#x4F55;&#x8C08;&#x590D;&#x6742;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x53EF;&#x60DC;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x89E3;&#x538B;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Windows&#x5E73;&#x53F0;&#x662F;&#x4E0D;&#x533A;&#x5206;&#x6587;&#x4EF6;&#x540D;&#x7684;&#x5927;&#x5C0F;&#x5199;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x539F;&#x6765;jar&#x4E2D;&#x7684;&#x5305;&#x540D;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x7C7B;&#x540D;&#x662F;&#x5927;&#x5C0F;&#x5199;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x89E3;&#x538B;&#x5230;&#x672C;&#x5730;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x51FA;&#x9519;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x5305;&#x91CC;&#x9762;&#x6709;A.class&#x548C;a.class&#x6587;&#x4EF6;&#xFF0C;&#x89E3;&#x538B;&#x5230;&#x672C;&#x5730;&#x524D;&#x8005;&#x4F1A;&#x88AB;&#x540E;&#x8005;&#x8986;&#x76D6;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x6709;&#x70B9;&#x7E41;&#x7410;&#x4E86;&#x3002;</span></p><p><span><strong><span>&#x7B2C;&#x4E09;&#x4E2A;&#x65B9;&#x6848;&#xFF1A;</span></strong>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#x7684;classes&#x6587;&#x4EF6;&#x585E;&#x5230;jar&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#xFF0C;&#x5B9E;&#x73B0;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x4E86;&#x3002;</span></p><p><strong><span>&#x6CE8;&#x610F;&#xFF1A;</span></strong></p><p><strong><span>1&#x3001;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x6587;&#x4EF6;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x9996;&#x5148;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x5305;&#x540D;&#x4E00;&#x5B9A;&#x8981;&#x5177;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x53EF;&#x4E0E;&#x539F;&#x6765;jar&#x4E2D;&#x7684;&#x7C7B;&#x91CD;&#x540D;&#x4E86;&#xFF0C;&#x8981;&#x60F3;&#x505A;&#x5230;&#x5B8C;&#x5168;&#x552F;&#x4E00;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F04;&#x4E00;&#x4E2A;&#x5947;&#x8469;&#x7684;&#x5305;&#x540D;&#x548C;&#x7C7B;&#x540D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x7528;&#x7684;&#x540D;&#x79F0;&#x662F;&#xFF1A;</span></strong></p><p><strong><span>cn.wjdiankong.jw.utils.JWUtils&#x8FD9;&#x4E2A;&#x540D;&#x79F0;&#x4E86;&#x3002;&#x73B0;&#x9636;&#x6BB5;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x6709;&#x91CD;&#x590D;&#x3002;</span></strong></p><p><span>&#x4EE3;&#x7801;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x548B;&#x4EEC;&#x76F4;&#x63A5;&#x6765;&#x770B;&#x770B;&#x5373;&#x53EF;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161205183158301?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x76F4;&#x63A5;&#x501F;&#x52A9;ZipEntry&#x7C7B;&#x8FDB;&#x884C;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5230;jar&#x6587;&#x4EF6;&#x4E2D;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6DFB;&#x52A0;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;ZipEntry&#x7684;&#x540D;&#x79F0;&#x5FC5;&#x987B;&#x662F;&#x7C7B;&#x7684;&#x5168;&#x8DEF;&#x5F84;&#x540D;&#x79F0;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4ECE;&#x5DE5;&#x5177;&#x547D;&#x4EE4;&#x5916;&#x90E8;&#x4F20;&#x5165;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x7C7B;&#x540D;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161205183202183?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x4E0B;&#x9762;&#x548B;&#x4EEC;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x4E2A;&#x7C7B;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#x8C03;&#x7528;&#x8FD9;&#x4E48;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x5373;&#x53EF;&#xFF1A;JWUtils.printStackTrace(&quot;jw&quot;);&#xFF0C;&#x800C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5BF9;&#x5E94;&#x7684;asm&#x4EE3;&#x7801;&#x4E3A;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161205183456059?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x4E0A;&#x9762;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E00;&#x4E0B;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x5F97;&#x5148;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x63D2;&#x5165;&#x7684;&#x7C7B;JWUtils</span></p><p><span><img src="http://img.blog.csdn.net/20161130135701971?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x9996;&#x5148;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5F97;&#x51C6;&#x5907;&#x4E00;&#x4E2A;cn.wjdiankong.jw.utils.JWUtils&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x7C7B;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6253;&#x5370;&#x5806;&#x6808;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</span></p><p><span>public static void printStackTrace(String tag){....}&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x83B7;&#x53D6;&#x5230;JWUtils.class&#x6587;&#x4EF6;&#x653E;&#x5230;&#x6307;&#x5B9A;&#x5DE5;&#x5177;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x5373;&#x53EF;&#x3002;&#x5F53;&#x6210;&#x529F;&#x7684;&#x628A;JWUtils.class&#x6587;&#x4EF6;&#x585E;&#x5165;&#x5230;jar&#x6587;&#x4EF6;&#x4E2D;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;dx&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x8F6C;&#x5316;&#x6210;dex&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130140034894?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x7528;JDK1.8&#x7F16;&#x8BD1;&#x4E86;JWUtils.java&#x6587;&#x4EF6;&#xFF0C;&#x800C;dx&#x5DE5;&#x5177;&#x4E0D;&#x517C;&#x5BB9;&#x8FD9;&#x4E2A;JDK&#x7248;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;1.8&#x4EE5;&#x4E0B;&#x7684;&#x7248;&#x672C;&#x7F16;&#x8BD1;JWUtils.java&#x6587;&#x4EF6;&#x5373;&#x53EF;&#x3002;</span></p><p><span>&#x6210;&#x529F;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x628A;dex&#x6587;&#x4EF6;&#x653E;&#x5230;apk&#x4E2D;&#xFF0C;&#x5728;&#x91CD;&#x65B0;&#x7B7E;&#x540D;&#x4E4B;&#x540E;&#x7684;apk&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;jadx&#x6253;&#x5F00;&#x67E5;&#x770B;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130140411332?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x5728;apk&#x4E2D;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x7684;&#x628A;&#x6211;&#x4EEC;&#x7684;JWUtils&#x7C7B;&#x63D2;&#x5165;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x968F;&#x4FBF;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x5176;&#x4ED6;&#x7C7B;&#x770B;&#x770B;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130140446943?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x5728;&#x7C7B;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#x4E5F;&#x6210;&#x529F;&#x8C03;&#x7528;&#x4E86;JWUtils.printStatckTrace&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x4E86;&#x3002;</span></p><p><span>&#x90A3;&#x4E48;&#x5230;&#x8FD9;&#x91CC;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x4ECE;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4EE5;&#x540E;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x81EA;&#x5DF1;&#x5728;&#x6253;&#x5370;&#x4EC0;&#x4E48;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;JWUtils&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x5B9E;&#x73B0;printStatckTrace&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x7C7B;&#x540D;&#x548C;&#x5305;&#x540D;&#x4EE5;&#x53CA;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x90FD;&#x5FC5;&#x987B;&#x4E00;&#x81F4;&#xFF0C;&#x4E0D;&#x7136;&#x4F1A;&#x62A5;&#x9519;&#x7684;&#x3002;</span></p><h1><span><strong><br></strong></span><strong><span>&#x4E09;&#x3001;&#x4E00;&#x952E;&#x5316;&#x529F;&#x80FD;&#x5B8C;&#x5584;&#x95EE;&#x9898;</span></strong></h1><p><span>&#x89E3;&#x51B3;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x548B;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6765;&#x89E3;&#x51B3;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x662F;&#x4E3A;&#x4E86;&#x5DE5;&#x5177;&#x66F4;&#x597D;&#x7684;&#x80FD;&#x591F;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4ECE;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x6E90;apk&#x5230;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x4EE3;&#x7801;&#x7684;apk&#x6709;&#x5F88;&#x591A;&#x6B65;&#x9AA4;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x975E;&#x5E38;&#x7E41;&#x7410;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x628A;&#x6BCF;&#x4E00;&#x6B65;&#x505A;&#x5230;&#x4EE3;&#x7801;&#x5316;&#xFF0C;&#x8BA9;&#x4F7F;&#x7528;&#x8BE5;&#x5DE5;&#x5177;&#x7684;&#x4EBA;&#x65E0;&#x611F;&#x77E5;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x952E;&#x5316;&#x4E3B;&#x8981;&#x4ECE;&#x4E0B;&#x9762;&#x51E0;&#x6B65;&#x8FDB;&#x884C;&#x5B8C;&#x5584;&#xFF1A;</span></p><p><strong><span>&#x7B2C;&#x4E00;&#x3001;&#x89E3;&#x538B;apk&#x6587;&#x4EF6;&#x83B7;&#x53D6;&#x5176;&#x6240;&#x6709;&#x7684;dex&#x6587;&#x4EF6;</span></strong></p><p><span><img src="http://img.blog.csdn.net/20161130141214790?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x4E0D;&#x89E3;&#x91CA;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x89E3;&#x538B;apk&#x4E2D;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x6837;&#x6CA1;&#x5FC5;&#x8981;&#x4E5F;&#x5F88;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x9700;&#x8981;&#x89E3;&#x538B;dex&#x6587;&#x4EF6;&#x548C;&#x7B7E;&#x540D;&#x76EE;&#x5F55;&#xFF0C;&#x56E0;&#x4E3A;&#x7B7E;&#x540D;&#x76EE;&#x5F55;&#x5728;&#x4E0B;&#x4E00;&#x6B65;&#x9700;&#x8981;&#x7528;&#x5230;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130141339423?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><strong><span>&#x7B2C;&#x4E8C;&#x3001;&#x5220;&#x9664;&#x539F;&#x59CB;&#x7B7E;&#x540D;&#x6587;&#x4EF6;</span></strong></p><p><span>&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x4E3A;&#x4E86;&#x540E;&#x9762;&#x7B7E;&#x540D;&#x5DE5;&#x4F5C;&#x51C6;&#x5907;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x91CC;&#x4E0D;&#x5220;&#x9664;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x7684;&#x8BDD;&#xFF0C;&#x540E;&#x9762;&#x518D;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x7B7E;&#x540D;&#x4F1A;&#x53D1;&#x73B0;&#x6709;&#x7684;apk&#x6709;&#x51B2;&#x7A81;</span></p><p><span><img src="http://img.blog.csdn.net/20161130141948935?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x4E86;&#x5427;&#xFF0C;&#x8FD9;&#x91CC;&#x5982;&#x679C;&#x4E0D;&#x5220;&#x9664;&#x539F;&#x59CB;&#x7B7E;&#x540D;&#xFF0C;&#x91CD;&#x7B7E;&#x540D;&#x4E4B;&#x540E;&#x7684;apk&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#xFF0C;&#x672C;&#x6765;Android&#x4E2D;&#x662F;&#x5141;&#x8BB8;&#x6709;&#x591A;&#x4E2A;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x4E5F;&#x5C31;&#x662F;&#x9700;&#x8981;&#x7528;&#x540C;&#x6837;&#x7684;&#x79C1;&#x94A5;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x660E;&#x663E;&#x4E0D;&#x662F;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5B89;&#x88C5;apk&#x4F1A;&#x62A5;&#x9519;&#x7684;&#x3002;&#x4ECE;&#x8FD9;&#x91CC;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x548B;&#x4EEC;&#x4E3A;&#x4E86;&#x540E;&#x9762;&#x91CD;&#x7B7E;&#x540D;&#x65B9;&#x4FBF;&#xFF0C;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#x628A;&#x539F;&#x59CB;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x5220;&#x9664;&#x5373;&#x53EF;&#x3002;</span></p><p><span><img src="http://img.blog.csdn.net/20161130142304264?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""></span></p><p><span>&#x8FD9;&#x91CC;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5C31;&#x76F4;&#x63A5;&#x501F;&#x52A9;aapt&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x5220;&#x9664;apk&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x4E86;&#xFF0C;&#x547D;&#x4EE4;&#x5F88;&#x7B80;&#x5355;&#xFF1A;</span></p><p><strong><span>aapt remove src.apk META-INF/XXX.RSA META-INF/XXX.SF MANIFEST.MF </span></strong></p><p><span>&#x56E0;&#x4E3A;aapt&#x4E0D;&#x652F;&#x6301;&#x76F4;&#x63A5;&#x5220;&#x9664;&#x76EE;&#x5F55;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x501F;&#x52A9;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#x7684;&#x89E3;&#x538B;META-INF&#x76EE;&#x5F55;&#xFF0C;&#x5F97;&#x5230;&#x5E94;&#x7528;&#x7684;&#x6240;&#x6709;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x91CC;&#x7EC4;&#x88C5;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x540D;&#x5373;&#x53EF;&#x3002;</span></p><p><strong><span>&#x7B2C;&#x4E09;&#x3001;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x5230;dex&#x6587;&#x4EF6;&#x4E2D;</span></strong></p><p><span><img src="http://img.blog.csdn.net/20161130142659594?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E2A;&#x4F9D;&#x7136;&#x7528;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x4ECB;&#x7ECD;&#x7684;&#x6539;&#x9020;&#x4E4B;&#x540E;&#x7684;dex2jar&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x628A;dex&#x8F6C;&#x5316;&#x6210;jar&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6BCF;&#x4E2A;&#x7C7B;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x6709;&#x7684;apk&#x4E2D;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;dex&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5904;&#x7406;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#x83B7;&#x53D6;&#x5230;&#x89E3;&#x538B;&#x4E4B;&#x540E;&#x7684;&#x6240;&#x6709;dex&#x6587;&#x4EF6;&#x3002;</span></p><h1><strong><span>&#x7B2C;&#x56DB;&#x3001;&#x7F16;&#x8BD1;JWUtils&#x7C7B;&#x6587;&#x4EF6;</span></strong></h1><p><span><img src="http://img.blog.csdn.net/20161201191019466?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x540E;&#x7EED;&#x62D3;&#x5C55;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x9700;&#x8981;&#x5916;&#x90E8;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;JWUtils.java&#x6587;&#x4EF6;&#xFF0C;&#x5185;&#x90E8;&#x6211;&#x4EEC;&#x81EA;&#x52A8;&#x4F7F;&#x7528;javac&#x5C06;&#x5176;&#x7F16;&#x8BD1;&#x6210;JWUtils.class&#x6587;&#x4EF6;&#x4E86;&#xFF0C;</span></p><p><strong><span><span>&#x6CE8;&#x610F;&#xFF1A;</span></span></strong></p><p><span>1&#x3001;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;javac&#x547D;&#x4EE4;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6307;&#x5B9A;&#x4E86;&#x7C7B;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x662F;UTF-8&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x60F3;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;JWUtils&#x7C7B;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x4E3A;UTF-8&#xFF0C;&#x4E0D;&#x7136;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x62A5;&#x9519;&#x3002;</span></p><p><span>2&#x3001;&#x56E0;&#x4E3A;JWUtils.java&#x4E2D;&#x7528;&#x5230;&#x4E86;Android&#x7684;&#x7CFB;&#x7EDF;api&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x643A;&#x5E26;&#x7CFB;&#x7EDF;&#x7684;android.jar&#x6587;&#x4EF6;&#x4E00;&#x8D77;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x5DE5;&#x4F5C;&#x3002;</span></p><h1><span><strong><br>&#x7B2C;&#x4E94;&#x3001;&#x6DFB;&#x52A0;JWUtils&#x7C7B;&#x6587;&#x4EF6;&#x5230;&#x6E90;jar&#x6587;&#x4EF6;&#x4E2D;</strong></span></h1><p><span><img src="http://img.blog.csdn.net/20161205183158301?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E00;&#x6B65;&#x4E3B;&#x8981;&#x662F;&#x6211;&#x4EEC;&#x628A;&#x4E0A;&#x9762;&#x7F16;&#x8BD1;&#x597D;&#x7684;JWUtils.class&#x6587;&#x4EF6;&#x76F4;&#x63A5;&#x585E;&#x5165;&#x5230;jar&#x6587;&#x4EF6;&#x4E2D;&#x5373;&#x53EF;&#x3002;</span></p><h1><strong><span>&#x7B2C;&#x516D;&#x3001;&#x5C06;jar&#x6587;&#x4EF6;&#x8F6C;&#x5316;&#x6210;dex&#x6587;&#x4EF6;</span></strong></h1><p><span><img src="http://img.blog.csdn.net/20161130143821553?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x56E0;&#x4E3A;&#x6709;&#x7684;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x591A;&#x4E2A;dex&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x548B;&#x4EEC;&#x5728;&#x7ED9;dex&#x6DFB;&#x52A0;JWUtils&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x4E3B;dex&#x4E2D;&#x6DFB;&#x52A0;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x6DFB;&#x52A0;&#x3002;&#x7136;&#x540E;&#x5C31;&#x501F;&#x52A9;dx.jar&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x8F6C;&#x5316;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;jar&#x5305;&#x5728;AndroidSDK&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x3002;&#x6784;&#x9020;&#x597D;dx&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#x76F4;&#x63A5;&#x8C03;&#x7528;main&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x3002;</span></p><h1><strong><span>&#x7B2C;&#x4E03;&#x3001;&#x6DFB;&#x52A0;dex&#x6587;&#x4EF6;&#x5230;&#x6E90;apk&#x4E2D;</span></strong></h1><p><span><img src="http://img.blog.csdn.net/20161130144207476?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x628A;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4EE3;&#x7801;&#x4E4B;&#x540E;&#x7684;dex&#x6587;&#x4EF6;&#x63D2;&#x5165;&#x5230;&#x6E90;apk&#x4E2D;&#xFF0C;&#x4F9D;&#x7136;&#x501F;&#x52A9;aapt&#x547D;&#x4EE4;&#x5373;&#x53EF;&#xFF0C;&#x56E0;&#x4E3A;aapt&#x547D;&#x4EE4;&#x4E0D;&#x652F;&#x6301;&#x6587;&#x4EF6;&#x8986;&#x76D6;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x548B;&#x4EEC;&#x5F97;&#x5148;&#x5220;&#x9664;&#x539F;&#x59CB;&#x7684;dex&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6DFB;&#x52A0;&#x65B0;&#x7684;dex&#x6587;&#x4EF6;&#x3002;</span></p><h1><strong><span>&#x7B2C;&#x516B;&#x3001;&#x91CD;&#x65B0;&#x7B7E;&#x540D;apk</span></strong></h1><p><span><img src="http://img.blog.csdn.net/20161130144331870?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E00;&#x6B65;&#x5C31;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;jarsigner&#x5DE5;&#x5177;&#x547D;&#x4EE4;&#x8FDB;&#x884C;apk&#x7B7E;&#x540D;&#x5373;&#x53EF;&#x3002;&#x7B7E;&#x540D;&#x4E4B;&#x540E;&#x7684;&#x6587;&#x4EF6;&#x4E3A;signed.apk&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x5199;&#x6B7B;&#x4E86;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x5916;&#x90E8;&#x4F20;&#x5165;&#x7684;&#x529F;&#x80FD;&#x3002;</span></p><p><span>&#x5230;&#x8FD9;&#x91CC;&#x548B;&#x4EEC;&#x5C31;&#x628A;&#x6240;&#x6709;&#x7684;&#x6B65;&#x9AA4;&#x7528;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6574;&#x5408;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x548B;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x7684;jar&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x5F97;&#x60F3;&#x60F3;&#x4E3A;&#x4E86;&#x8BA9;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x66F4;&#x597D;&#x7684;&#x62D3;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;&#x5916;&#x90E8;&#x4F20;&#x5165;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#x505A;&#x6210;&#x52A8;&#x6001;&#x5316;&#x529F;&#x80FD;,&#x8FD9;&#x91CC;&#x63A5;&#x53D7;&#x4E86;&#x5916;&#x90E8;&#x4F20;&#x5165;&#x7684;5&#x4E2A;&#x53C2;&#x6570;&#x4FE1;&#x606F;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130145117833?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x63A5;&#x53D7;&#x7684;5&#x4E2A;&#x53C2;&#x6570;&#x5982;&#x4E0B;&#xFF1A;</span></p><p><strong><span>1&#x300B;&#x5DE5;&#x5177;&#x8FD0;&#x884C;&#x7684;&#x5F53;&#x524D;&#x76EE;&#x5F55;</span></strong></p><p><strong><span>2&#x300B;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x6E90;apk&#x6587;&#x4EF6;&#x8DEF;&#x5F84;</span></strong></p><p><strong><span>3&#x300B;aapt&#x547D;&#x4EE4;&#x7684;&#x8DEF;&#x5F84;</span></strong></p><p><strong><span>4&#x300B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;tag&#xFF0C;&#x9ED8;&#x8BA4;&#x662F;&#xFF1A;jw</span></strong></p><p><strong><span>5&#x300B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;&#x7C7B;&#x540D;&#xFF0C;&#x9ED8;&#x8BA4;&#x662F;&#xFF1A;cn.wjdiankong.jw.utils.JWUtils</span></strong></p><p><strong><span>6&#x300B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#xFF1A;&#x9ED8;&#x8BA4;&#x662F;&#xFF1A;printStackTrace</span></strong></p><p><span>&#x7136;&#x540E;&#x548B;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5224;&#x65AD;aapt&#x547D;&#x4EE4;&#x8DEF;&#x5F84;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x914D;&#x7F6E;&#x4E86;JAVA_HOME&#x73AF;&#x5883;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x9762;&#x51E0;&#x6B65;&#x90FD;&#x4F1A;&#x4F9D;&#x8D56;aapt&#x5DE5;&#x5177;&#x548C;java&#x7684;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x5185;&#x5BB9;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;</span></p><p><span>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x63A5;&#x53D7;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5916;&#x90E8;&#x5C31;&#x597D;&#x6269;&#x5C55;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x6253;&#x5370;&#x6D88;&#x606F;&#x7684;&#x7C7B;&#xFF0C;&#x7C7B;&#x540D;&#x548C;&#x5305;&#x540D;&#x968F;&#x610F;&#x5B9A;&#x4E49;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x5B9A;&#x4E49;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;<strong>&#x4F46;&#x662F;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x4E0D;&#x53EF;&#x53D8;&#x4E5F;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x662F;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#xFF1A;public static void XXX(String tag)</strong>&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x6CA1;&#x90A3;&#x4E2A;&#x5FC5;&#x8981;&#x4E86;&#x3002;&#x6709;&#x8FD9;&#x4E9B;&#x62D3;&#x5C55;&#x5E94;&#x8BE5;&#x8DB3;&#x591F;&#x7528;&#x4E86;&#x3002;&#x540E;&#x7EED;&#x770B;&#x7528;&#x6237;&#x53CD;&#x9988;&#x53EF;&#x4EE5;&#x5728;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x4FEE;&#x6539;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x53EF;&#x6267;&#x884C;jar&#x5305;&#xFF0C;&#x548B;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x5199;&#x4E00;&#x4E2A;&#x6279;&#x5904;&#x7406;icodetools.bat&#xFF1A;</span></p><p><span><strong>cd %~dp0<br>set aapt_path=D:\Android_tools\AndroidSdk\build-tools\23.0.1\aapt.exe<br><span>java -jar libs\icode_tools.jar %~dp0 src.apk %aapt_path% jw cn.wjdiankong.jw.utils.JWUtils printStackTrace</span><br>adb install -r signed.apk<br>pause..</strong><br></span></p><p><span>&#x9996;&#x5148;&#x8FDB;&#x5165;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x7F6E;aapt_path&#x73AF;&#x5883;&#x53D8;&#x91CF;&#xFF0C;&#x63A5;&#x7740;&#x5C31;&#x8981;&#x8C03;&#x7528;&#x548B;&#x4EEC;&#x5BFC;&#x51FA;&#x6765;&#x7684;icode_tools.jar&#x5305;&#x4E86;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x8F93;&#x5165;&#x4E86;&#x4E0A;&#x9762;&#x5BF9;&#x5E94;&#x7684;6&#x4E2A;&#x53C2;&#x6570;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x539F;&#x59CB;apk&#x8DEF;&#x5F84;&#xFF0C;aapt&#x8DEF;&#x5F84;&#xFF0C;&#x6253;&#x5370;&#x6D88;&#x606F;&#x7684;tag&#x7B49;&#x3002;&#x6700;&#x540E;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x76F4;&#x63A5;&#x5728;&#x4E00;&#x952E;&#x5316;&#x5B89;&#x88C5;apk&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E00;&#x6B65;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x4E0D;&#x8FC7;&#x5931;&#x8D25;&#x4E86;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x60F3;&#x529E;&#x6CD5;&#x5B89;&#x88C5;&#x5373;&#x53EF;&#xFF0C;&#x7B7E;&#x540D;&#x4E4B;&#x540E;&#x7684;apk&#x662F;signed.apk&#xFF0C;&#x672A;&#x7B7E;&#x540D;&#x7684;apk&#x662F;unsigned.apk&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x7B7E;&#x540D;&#x7684;&#x3002;</span></p><p><span>&#x7136;&#x540E;&#x5C31;&#x662F;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;jar&#x5305;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x7F16;&#x8BD1;&#x7C7B;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x5F15;&#x7528;&#x5230;&#x7CFB;&#x7EDF;api&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x8981;&#x7528;&#x5230;android.jar&#x6587;&#x4EF6;&#xFF0C;&#x653E;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684;libs&#x4E0B;&#x9762;&#xFF0C;&#x540C;&#x65F6;icode_tools.jar&#x4E5F;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x6700;&#x540E;&#x5C31;&#x662F;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6253;&#x5370;&#x6D88;&#x606F;&#x7684;&#x5DE5;&#x5177;&#x7C7B;JWUtils.java&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x548B;&#x4EEC;&#x5DE5;&#x5177;&#x7684;&#x76EE;&#x5F55;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161205184041046?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x7684;&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x5728;&#x5DE5;&#x5177;&#x4E2D;&#x5199;&#x6B7B;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x652F;&#x6301;&#x4FEE;&#x6539;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x81EA;&#x5DF1;&#x91CD;&#x7B7E;&#x540D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x8FD0;&#x884C;&#x5B8C;&#x4E4B;&#x540E;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x4E00;&#x4E2A;unsigned.apk&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x5373;&#x53EF;&#x3002;</span></p><p><span>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x548B;&#x4EEC;&#x80AF;&#x5B9A;&#x60F3;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x7684;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x53CC;&#x51FB;icodetools_1.0.bat&#x6279;&#x5904;&#x7406;&#x5373;&#x53EF;&#x5750;&#x7B49;&#x7ED3;&#x679C;&#x4E86;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161201191405362?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x6240;&#x6709;&#x6B65;&#x9AA4;&#x4E00;&#x6C14;&#x5475;&#x6210;&#xFF0C;&#x591A;&#x4E48;&#x667A;&#x80FD;&#x4E00;&#x952E;&#x5316;&#xFF0C;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x90A3;&#x4E48;&#x8D39;&#x52B2;&#x4E86;&#x3002;&#x8FD0;&#x884C;&#x5B8C;&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#x7684;&#x76EE;&#x5F55;&#x6709;&#x4E86;&#x7B7E;&#x540D;&#x548C;&#x672A;&#x7B7E;&#x540D;&#x7684;apk&#x6587;&#x4EF6;&#x5982;&#x4E0B;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161205184432490?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x540E;&#x7EED;&#x8FD8;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x64CD;&#x4F5C;&#x8FD9;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x60F3;&#x600E;&#x4E48;&#x73A9;&#x5C31;&#x600E;&#x4E48;&#x73A9;&#x3002;</span></p><h1><strong><span>&#x56DB;&#x3001;&#x6848;&#x4F8B;&#x5B9E;&#x8DF5;</span></strong></h1><p><span>&#x5DE5;&#x5177;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0A;&#x9762;&#x90FD;&#x662F;&#x7528;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x6848;&#x4F8B;apk&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x660E;&#x663E;&#x4E0D;&#x7B26;&#x5408;&#x73B0;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x68C0;&#x9A8C;&#x6B64;&#x5DE5;&#x5177;&#x7684;&#x725B;&#x903C;&#x6027;&#xFF0C;&#x5FC5;&#x987B;&#x7528;&#x4E00;&#x4E9B;&#x5927;&#x578B;app&#x6765;&#x505A;&#x5B9E;&#x9A8C;&#x3002;<strong>&#x56E0;&#x4E3A;&#x771F;&#x7684;&#x52C7;&#x58EB;&#x6562;&#x4E8E;&#x9762;&#x5BF9;&#x6DCB;&#x6F13;&#x7684;&#x9C9C;&#x8840;&#xFF01;</strong>&#x4E0B;&#x9762;&#x5C31;&#x7528;&#x4E00;&#x4E2A;&#x73B0;&#x5728;&#x5F88;&#x706B;&#x7684;&#x76F4;&#x64AD;&#x8F6F;&#x4EF6;&#x6765;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x4E3A;&#x4F55;&#x4E0D;&#x7528;&#x5FAE;&#x4FE1;&#xFF0C;&#x522B;&#x7740;&#x6025;&#x5FAE;&#x4FE1;&#x540E;&#x9762;&#x518D;&#x7528;&#x3002;</span></p><p><span><img src="http://img.blog.csdn.net/20161130173638343?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x5305;&#x542B;&#x4E86;&#x591A;&#x4E2A;dex&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;dex&#x6587;&#x4EF6;&#x8F83;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5904;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x6162;&#x6162;&#x7684;&#x7B49;&#x5F85;</span></p><p><span>&#x7B49;&#x64CD;&#x4F5C;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;&#x548B;&#x4EEC;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#xFF0C;&#x8F93;&#x51FA;log&#x4FE1;&#x606F;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130173758384?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x65E5;&#x5FD7;&#x5237;&#x5237;&#x7684;&#xFF0C;&#x592A;&#x8FA3;&#x773C;&#x775B;&#x4E86;&#x5B8C;&#x5168;&#x628A;&#x63E1;&#x6643;&#x6655;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x6B21;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x5982;&#x4F55;&#x8BA9;&#x8FD9;&#x4E9B;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x4E0D;&#x9738;&#x5C4F;&#xFF0C;&#x5728;&#x6307;&#x5B9A;&#x5730;&#x65B9;&#x6253;&#x5370;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;</span></p><h1><strong><span>&#x4E94;&#x3001;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x6253;&#x5370;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;</span></strong></h1><p><span>&#x4ECE;&#x4E0A;&#x9762;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x4E86;&#x6240;&#x6709;&#x7684;&#x4E00;&#x952E;&#x5316;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x60DC;&#x7684;&#x662F;&#x88AB;&#x90A3;&#x4E9B;&#x65E5;&#x5FD7;&#x9738;&#x5C4F;&#x4E86;&#xFF0C;&#x5B8C;&#x5168;&#x61F5;&#x903C;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6211;&#x8FD8;&#x5F97;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x7ED9;&#x8FD9;&#x4E2A;&#x65E5;&#x5FD7;&#x52A0;&#x4E00;&#x4E9B;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x63A7;&#x5236;&#x65E5;&#x5FD7;&#xFF0C;&#x8BA9;&#x4ED6;&#x53D7;&#x6211;&#x63A7;&#x5236;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x548C;&#x4E0A;&#x9762;&#x7684;&#x5DE5;&#x5177;&#x6CA1;&#x591A;&#x5927;&#x5173;&#x7CFB;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x90A3;&#x4E2A;&#x6253;&#x5370;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x88AB;&#x5F04;&#x51FA;&#x6765;&#x653E;&#x5230;&#x4E86;JWUtils&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x7C7B;&#x662F;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x7136;&#x540E;&#x63D2;&#x5165;&#x5230;dex&#x4E2D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x548B;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4FEE;&#x6539;JWUtils&#x4E2D;&#x7684;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x3002;</span></p><p><span><img src="http://img.blog.csdn.net/20161130180110832?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x4E0B;&#x9762;&#x5C31;&#x662F;&#x6211;&#x5199;&#x7684;JWUtils&#x7C7B;&#xFF0C;&#x5185;&#x90E8;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#xFF1A;&#x63A7;&#x5236;&#x65E5;&#x5FD7;&#x7684;&#x603B;&#x5F00;&#x5173;&#xFF0C;&#x9700;&#x8981;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x7C7B;&#x540D;&#x7B49;&#x89C4;&#x5219;&#x3002;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5185;&#x5BB9;&#xFF1A;</span></p><p><strong><span>-s 1 -m JW -r int -p [int,java.lang.String] -c JWUtils<br></span></strong></p><p><strong><span>-s&#xFF1A;&#x8868;&#x793A;&#x65E5;&#x5FD7;&#x603B;&#x5F00;&#x5173;</span></strong></p><p><strong><span>-m&#xFF1A;&#x8868;&#x793A;&#x9700;&#x8981;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x79F0;</span></strong></p><p><strong><span>-r&#xFF1A;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x7C7B;&#x578B;</span></strong></p><p><strong><span>-p&#xFF1A;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x591A;&#x4E2A;&#x7C7B;&#x578B;&#x76F4;&#x63A5;&#x7528;&#x5206;&#x53F7;&#x9694;&#x5F00;</span></strong></p><p><strong><span>-c&#xFF1A;&#x8868;&#x793A;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x7684;&#x7C7B;&#x540D;</span></strong></p><p><span>&#x7136;&#x540E;&#x6211;&#x628A;&#x8FD9;&#x884C;&#x5B57;&#x7B26;&#x4E32;&#x5185;&#x5BB9;&#x4FDD;&#x5B58;&#x5230;/data/local/tmp/log.txt&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4FDD;&#x5B58;&#x5230;&#x8FD9;&#x91CC;&#x5462;&#xFF1F;&#x6709;&#x7684;&#x540C;&#x5B66;&#x60F3;&#x4FDD;&#x5B58;&#x5230;SD&#x5361;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5047;&#x5982;&#x6709;&#x7684;&#x5E94;&#x7528;&#x6CA1;&#x6709;&#x58F0;&#x660E;SD&#x8BFB;&#x5199;&#x6743;&#x9650;&#xFF0C;&#x90A3;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x7684;JWUtils&#x7C7B;&#x662F;&#x88AB;&#x63D2;&#x5165;&#x5230;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x60F3;&#x5230;&#x4E86;&#x7CFB;&#x7EDF;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x9700;&#x8981;&#x6743;&#x9650;&#x6709;&#x6CA1;&#x6709;&#x6C99;&#x76D2;&#x6743;&#x9650;&#x9650;&#x5236;&#x7684;&#x76EE;&#x5F55;&#xFF1A;<strong>/data/local/tmp/</strong>&#x3002;</span></p><p><span>&#x4E0B;&#x9762;&#x7B80;&#x8981;&#x7684;&#x8BF4;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x5427;&#xFF1A;</span></p><p><span>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x83B7;&#x53D6;&#x5F53;&#x524D;&#x65B9;&#x6CD5;&#x7684;&#x5806;&#x6808;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x5F53;&#x524D;&#x65B9;&#x6CD5;&#x540D;&#x548C;&#x7C7B;&#x540D;&#x4E86;&#xFF1A;</span></p><p><span>StackTraceElement[] stackElements = new Throwable().getStackTrace();<br></span></p><p><span>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x83B7;&#x53D6;&#x5230;&#x88AB;&#x63D2;&#x5165;&#x6253;&#x5370;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x53EA;&#x8981;&#x83B7;&#x53D6;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x5373;&#x53EF;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5176;&#x5B9E;&#x662F;JWUtils.printStackTrace&#x65B9;&#x6CD5;&#x4FE1;&#x606F;&#x4E86;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x4E4B;&#x540E;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x5F53;&#x524D;&#x65B9;&#x6CD5;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x540D;&#x79F0;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x65B9;&#x6CD5;&#x540D;&#x548C;&#x7C7B;&#x578B;&#x7684;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x4E86;&#x3002;</span></p><p><span>&#x800C;&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x53EA;&#x80FD;&#x7B80;&#x5355;&#x7684;&#x83B7;&#x53D6;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x548C;&#x7C7B;&#x578B;&#xFF0C;&#x5374;&#x83B7;&#x53D6;&#x4E0D;&#x5230;&#x5BF9;&#x5E94;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x7B49;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5F97;&#x8D39;&#x70B9;&#x4E8B;&#xFF0C;&#x5C31;&#x662F;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x7C7B;&#x540D;&#x7136;&#x540E;&#x7528;Class.forName&#x65B9;&#x6CD5;&#x83B7;&#x53D6;&#x5230;&#x5BF9;&#x5E94;&#x7C7B;&#x7684;Class&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x83B7;&#x53D6;&#x8BE5;&#x7C7B;&#x6240;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x4FE1;&#x606F;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130181629885?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x7136;&#x540E;&#x7528;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#xFF0C;&#x5728;&#x7ED3;&#x5408;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x53BB;&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x6307;&#x5B9A;&#x65B9;&#x6CD5;&#x540D;&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#x4FE1;&#x606F;&#x4E86;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130181800526?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x540C;&#x5B66;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5047;&#x5982;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x6709;&#x91CD;&#x6784;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x65B9;&#x6CD5;&#x540D;&#x76F8;&#x540C;&#x7684;&#x4F46;&#x662F;&#x65B9;&#x6CD5;&#x7B7E;&#x540D;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x91CC;&#x56E0;&#x4E3A;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x68C0;&#x6D4B;&#x65B9;&#x6CD5;&#x540D;&#x6765;&#x83B7;&#x53D6;&#x5230;method&#x7684;&#x4FE1;&#x606F;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x91CD;&#x6784;&#x65B9;&#x6CD5;&#x662F;&#x6CA1;&#x6709;&#x8FC7;&#x6EE4;&#x6548;&#x679C;&#x7684;&#x3002;</span></p><p><span>&#x6700;&#x540E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x603B;&#x5F00;&#x5173;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7684;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x5982;&#x4E0B;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130182040744?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x4E4B;&#x540E;&#xFF0C;&#x548B;&#x4EEC;&#x518D;&#x6B21;&#x64CD;&#x4F5C;&#x4E00;&#x4E0B;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;JWUtils&#x7C7B;&#x653E;&#x5230;icode_tools&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6B21;&#x8DD1;&#x4E00;&#x4E0B;icode_tools&#x6279;&#x5904;&#x7406;&#xFF0C;&#x5B89;&#x88C5;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5148;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x5C31;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x4E86;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130182832911?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x6211;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x628A;&#x65E5;&#x5FD7;&#x5173;&#x95ED;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6253;&#x5F00;&#xFF0C;&#x5728;&#x5173;&#x95ED;&#x770B;&#x4E00;&#x4E0B;&#x6548;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;echo&#x547D;&#x4EE4;&#x5199;&#x5165;&#x4E00;&#x6761;&#x89C4;&#x5219;&#x5173;&#x95ED;&#x65E5;&#x5FD7;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130184034304?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x4E86;&#x5427;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x603B;&#x5F00;&#x5173;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x65E5;&#x5FD7;&#x8F93;&#x51FA;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x518D;&#x6765;&#x4E00;&#x6761;&#x5B9E;&#x9645;&#x7684;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5305;&#x540D;&#xFF0C;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x7B49;&#x89C4;&#x5219;&#x64CD;&#x4F5C;&#x4E00;&#x4E0B;&#xFF1A;<strong>-s 1 -m a -c com.meelive.ingkee.v1.core.a.a</strong></span></p><p><span><img src="http://img.blog.csdn.net/20161130185028384?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#x540D;&#x548C;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x9650;&#x5236;&#xFF0C;&#x6253;&#x5370;&#x4E4B;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x662F;&#x6307;&#x5B9A;&#x7C7B;&#x540D;&#x7684;&#x65B9;&#x6CD5;&#x65E5;&#x5FD7;&#x4E86;&#x3002;</span></p><p><span>&#x4E0A;&#x9762;&#x64CD;&#x4F5C;&#x7684;&#x662F;&#x67D0;&#x76F4;&#x64AD;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E3A;&#x4E86;&#x6709;&#x8BF4;&#x670D;&#x529B;&#xFF0C;&#x6211;&#x5F97;&#x7528;&#x5FAE;&#x4FE1;&#x5728;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x54C8;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161130185655499?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x6B64;&#x523B;&#x6211;&#x4EEC;&#x52A0;&#x4E0A;&#x89C4;&#x5219;&#x4E4B;&#x540E;&#xFF0C;&#x6253;&#x5F00;&#x5FAE;&#x4FE1;&#x987F;&#x65F6;&#x89C9;&#x5F97;&#x723D;&#x591A;&#x4E86;&#xFF0C;&#x65E5;&#x5FD7;&#x4E0D;&#x591A;&#xFF0C;&#x6162;&#x6162;&#x64CD;&#x4F5C;&#x67E5;&#x770B;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x5FAE;&#x4FE1;&#x7684;&#x65E5;&#x5FD7;&#x770B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x70ED;&#x4FEE;&#x590D;&#x6846;&#x67B6;Tinker&#x4E86;&#x3002;&#x540E;&#x9762;&#x5F97;&#x8D76;&#x5FEB;&#x51FA;&#x4E00;&#x7BC7;&#x5206;&#x6790;Tinker&#x6846;&#x67B6;&#x7684;&#x6587;&#x7AE0;&#x4E86;&#x3002;</span></p><p><span>&#x6700;&#x540E;&#x5728;&#x6765;&#x770B;&#x4E00;&#x4E0B;QQ&#x7684;&#x65E5;&#x5FD7;&#xFF1A;</span></p><p><span><img src="http://img.blog.csdn.net/20161201085206108?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><strong><span><span>&#x6CE8;&#x610F;&#xFF1A;</span><span>&#x6B64;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x6253;&#x5370;&#x6D88;&#x606F;&#x903B;&#x8F91;&#x90FD;&#x5728;JWUtils&#x7C7B;&#x4E2D;&#xFF0C;&#x4E0A;&#x9762;&#x8BF4;&#x5230;&#x8FD9;&#x4E2A;&#x7C7B;&#x662F;&#x5F00;&#x653E;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x968F;&#x4FBF;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x4FE1;&#x606F;&#xFF01;</span></span></strong></p><h1><span>&#x516D;&#x3001;&#x95EE;&#x9898;&#x603B;&#x7ED3;</span></h1><p><span>&#x597D;&#x4E86;&#xFF0C;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89E3;&#x51B3;&#x4E86;&#x5728;&#x524D;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x586B;&#x5B8C;&#x4E86;&#x5DE5;&#x5177;&#x7684;&#x5751;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</span></p><p><span><strong>&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x4E86;&#x95EE;&#x9898;&#xFF0C;</strong>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7ED9;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x6253;&#x5370;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4E00;&#x4E2A;dex&#x4E2D;&#x5305;&#x542B;&#x5F88;&#x591A;&#x7C7B;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x989D;&#x5916;&#x589E;&#x52A0;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x4F7F;&#x7528;dx&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x8F6C;&#x5316;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x4E86;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x7684;&#x95EE;&#x9898;&#x3002;</span></p><p><span><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</strong>&#x53EF;&#x4EE5;&#x628A;&#x6253;&#x5370;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#x62BD;&#x53D6;&#x5230;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x7C7B;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x7C7B;&#x63D2;&#x5165;&#x5230;dex&#x4E2D;&#xFF0C;&#x8FD9;&#x91CC;&#x91C7;&#x7528;&#x7684;&#x65B9;&#x6848;&#x662F;&#x901A;&#x8FC7;dex2jar&#x5DE5;&#x5177;&#x8F6C;&#x5316;dex&#x6210;jar&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x7F16;&#x8BD1;&#x9700;&#x8981;&#x63D2;&#x5165;&#x7684;&#x7C7B;&#x6587;&#x4EF6;&#xFF0C;&#x628A;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#x7684;&#x7C7B;&#x6587;&#x4EF6;&#x76F4;&#x63A5;&#x585E;&#x5165;&#x5230;jar&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x539F;&#x5148;&#x7684;dex&#x57FA;&#x7840;&#x4E0A;&#x6BCF;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x53EA;&#x9700;&#x8981;&#x8C03;&#x7528;JWUtils.printStackTrace&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x3002;</span></p><p><span><strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4E00;&#x952E;&#x5316;&#x5B8C;&#x5584;&#x5DE5;&#x4F5C;&#xFF0C;</strong>&#x8FD9;&#x4E2A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x6587;&#x7AE0;&#x4E2D;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x4ECE;&#x62BD;&#x79BB;apk&#x4E2D;&#x7684;dex&#x6587;&#x4EF6;&#x5230;&#x6700;&#x7EC8;&#x91CD;&#x7B7E;&#x540D;apk&#x6587;&#x4EF6;&#x6709;&#x5F88;&#x591A;&#x6B65;&#x9AA4;&#xFF0C;&#x4F46;&#x662F;&#x90FD;&#x662F;&#x4EBA;&#x5DE5;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x975E;&#x5E38;&#x7E41;&#x7410;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x8FDB;&#x884C;&#x6574;&#x5408;&#x4E00;&#x6B65;&#x5230;&#x4F4D;&#x3002;</span></p><p><span><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</strong>&#x5148;&#x4ECE;apk&#x4E2D;&#x89E3;&#x538B;&#x51FA;dex&#x6587;&#x4EF6;&#x548C;&#x7B7E;&#x540D;&#x6587;&#x4EF6;==&#x300B;&#x5229;&#x7528;aapt&#x547D;&#x4EE4;&#x5220;&#x9664;apk&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#x6587;&#x4EF6;==&#x300B;&#x6DFB;&#x52A0;&#x4EE3;&#x7801;&#x5230;dex&#x4E2D;==&#x300B;&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#x7C7B;&#x5F97;&#x5230;class&#x6587;&#x4EF6;&#xFF0C;&#x585E;&#x5165;&#x5230;jar&#x6587;&#x4EF6;&#x4E2D;==&#x300B;&#x4F7F;&#x7528;dx&#x547D;&#x4EE4;&#x8F6C;&#x5316;&#x6210;dex&#x6587;&#x4EF6;==&#x300B;&#x4F7F;&#x7528;aapt&#x547D;&#x4EE4;&#x8986;&#x76D6;apk&#x4E2D;&#x65E7;&#x7684;dex&#x6587;&#x4EF6;==&#x300B;&#x4F7F;&#x7528;jarsigner&#x5BF9;apk&#x91CD;&#x65B0;&#x7B7E;&#x540D;&#x3002;</span></p><p><span>&#x7136;&#x540E;&#x628A;&#x5DE5;&#x7A0B;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x7684;jar&#x5305;&#xFF0C;&#x8FD9;&#x91CC;&#x4E3A;&#x4E86;&#x540E;&#x7EED;&#x6269;&#x5C55;&#xFF0C;&#x5C31;&#x63D0;&#x4F9B;&#x4E86;&#x6267;&#x884C;&#x7684;&#x5165;&#x53E3;&#x53C2;&#x6570;&#xFF1A;</span></p><p><span>1&#x300B;&#x5DE5;&#x5177;&#x8FD0;&#x884C;&#x7684;&#x5F53;&#x524D;&#x76EE;&#x5F55;</span></p><p><span>2&#x300B;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x6E90;apk&#x6587;&#x4EF6;&#x8DEF;&#x5F84;</span></p><p><span>3&#x300B;aapt&#x547D;&#x4EE4;&#x7684;&#x8DEF;&#x5F84;</span></p><p><span>4&#x300B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;tag&#xFF0C;&#x9ED8;&#x8BA4;&#x662F;&#xFF1A;jw</span></p><p><span>5&#x300B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;&#x7C7B;&#x540D;&#xFF0C;&#x9ED8;&#x8BA4;&#x662F;&#xFF1A;cn.wjdiankong.jw.utils.JWUtils</span></p><p><span>6&#x300B;&#x6253;&#x5370;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#xFF1A;&#x9ED8;&#x8BA4;&#x662F;&#xFF1A;printStackTrace</span></p><p><span>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6279;&#x5904;&#x7406;icodetools.bat&#x6587;&#x4EF6;&#xFF0C;&#x4E3B;&#x8981;&#x6267;&#x884C;&#x7684;&#x547D;&#x4EE4;&#x662F;&#xFF1A;</span></p><p><span>java -jar libs\icode_tools.jar %~dp0 src.apk %aapt_path% jw cn.wjdiankong.jw.utils.JWUtils printStackTrace<br></span></p><p><span><strong>&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4F18;&#x5316;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x89C4;&#x5219;&#xFF0C;</strong>&#x8FD9;&#x4E2A;&#x662F;&#x56E0;&#x4E3A;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x952E;&#x5316;&#x5DE5;&#x5177;&#x751F;&#x6210;apk&#x5B89;&#x88C5;&#x8FD0;&#x884C;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x592A;&#x591A;&#x5BFC;&#x81F4;&#x9738;&#x5C4F;&#xFF0C;&#x800C;&#x4E14;&#x5E94;&#x7528;&#x672C;&#x8EAB;&#x8FD8;&#x4F1A;&#x51FA;&#x73B0;&#x4E86;ANR&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#x5F97;&#x60F3;&#x4E2A;&#x529E;&#x6CD5;&#x63A7;&#x5236;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x8F93;&#x51FA;&#x3002;</span></p><p><span><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</strong>&#x52A0;&#x4E00;&#x4E9B;&#x65E5;&#x5FD7;&#x8F93;&#x51FA;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#xFF0C;&#x9996;&#x5148;&#x548B;&#x4EEC;&#x5F97;&#x6709;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x603B;&#x5F00;&#x5173;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x9700;&#x8981;&#x6253;&#x5370;&#x65B9;&#x6CD5;&#x6240;&#x5C5E;&#x7684;&#x7C7B;&#x540D;&#xFF0C;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x4EE5;&#x53CA;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x7B49;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x3002;</span></p><p><span>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x6EE4;&#x89C4;&#x5219;&#x90FD;&#x662F;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5C31;&#x5728;JWUtils&#x7C7B;&#x4E2D;&#xFF0C;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x4FEE;&#x6539;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x6211;&#x5DF2;&#x7ECF;&#x52A0;&#x4E86;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#xFF1A;</span></p><p><span>-s 1 -m JW -r int -p [int,java.lang.String] -c JWUtils<br></span></p><p><span>-s&#xFF1A;&#x8868;&#x793A;&#x65E5;&#x5FD7;&#x603B;&#x5F00;&#x5173;</span></p><p><span>-m&#xFF1A;&#x8868;&#x793A;&#x9700;&#x8981;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x79F0;</span></p><p><span>-r&#xFF1A;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x7C7B;&#x578B;</span></p><p><span>-p&#xFF1A;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x591A;&#x4E2A;&#x7C7B;&#x578B;&#x76F4;&#x63A5;&#x7528;&#x5206;&#x53F7;&#x9694;&#x5F00;</span></p><p><span>-c&#xFF1A;&#x8868;&#x793A;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x7684;&#x7C7B;&#x540D;</span></p><span>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;echo&#x547D;&#x4EE4;&#x7ED9;/data/local/tmp/log.txt&#x6587;&#x4EF6;&#x8F93;&#x5165;&#x89C4;&#x5219;&#x6765;&#x63A7;&#x5236;&#x65E5;&#x5FD7;&#x8F93;&#x51FA;&#x3002;</span><h1><span>&#x4E03;&#x3001;&#x589E;&#x957F;&#x7ECF;&#x9A8C;&#x503C;</span></h1><p><span>&#x672C;&#x6587;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5230;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x548C;&#x7ECF;&#x9A8C;&#x503C;&#xFF1A;</span></p><p><span>1&#x3001;&#x4E86;&#x89E3;&#x5230;&#x4E00;&#x79CD;&#x5F80;dex&#x6587;&#x4EF6;&#x4E2D;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x7C7B;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;</span></p><p><span>&#x5148;&#x628A;dex&#x8F6C;&#x6210;jar&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x538B;jar&#x6587;&#x4EF6;&#xFF0C;&#x590D;&#x5236;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x6587;&#x4EF6;&#x5230;&#x89E3;&#x538B;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4F7F;&#x7528;jar&#x547D;&#x4EE4;&#x8FDB;&#x884C;class&#x6587;&#x4EF6;&#x91CD;&#x65B0;&#x6253;&#x5305;&#x6210;jar&#x6587;&#x4EF6;&#x5373;&#x53EF;&#x3002;&#x6700;&#x540E;&#x5728;&#x4F7F;&#x7528;dx&#x547D;&#x4EE4;&#x8F6C;&#x6210;dex&#x6587;&#x4EF6;&#x3002;</span></p><p><span>2&#x3001;&#x4E86;&#x89E3;&#x5230;&#x5982;&#x4F55;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x5F97;&#x5230;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x3002;</span></p><p><span>&#x901A;&#x8FC7;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x83B7;&#x53D6;&#x5230;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#x548C;&#x6240;&#x5728;&#x7684;&#x7C7B;&#x540D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4F7F;&#x7528;Class.forName&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x7C7B;&#x540D;&#x5F97;&#x5230;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4F7F;&#x7528;&#x53CD;&#x5C04;&#x83B7;&#x53D6;&#x5230;&#x8BE5;&#x7C7B;&#x5BF9;&#x5E94;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E4B;&#x524D;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x8FDB;&#x884C;&#x68C0;&#x7D22;&#x83B7;&#x53D6;&#x5230;&#x5BF9;&#x5E94;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x3002;</span></p><p><span>3&#x3001;javac&#xFF0C;jarsiginer&#xFF0C;aapt&#x547D;&#x4EE4;&#x7684;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#x3002;</span></p><h1><strong><span>&#x516B;&#x3001;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#x8BF4;&#x660E;</span></strong></h1><p><span>1&#x3001;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x7684;apk&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x9ED8;&#x8BA4;&#x662F;src.apk&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x4FEE;&#x6539;apk&#x540D;&#x79F0;&#xFF0C;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x7684;&#x4FEE;&#x6539;icodetools.bat&#x4E2D;&#x7684;apk&#x6587;&#x4EF6;&#x540D;</span></p><p><span>2&#x3001;&#x5728;icodetools.bat&#x4E2D;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5F53;&#x524D;&#x65E5;&#x5FD7;&#x7684;tag&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x662F;jw</span></p><p><span>3&#x3001;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;JWUtils.java&#x8FD9;&#x4E2A;java&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x6253;&#x5370;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5B9A;&#x4E49;&#x7684;&#x65B9;&#x6CD5;&#x5FC5;&#x987B;&#x6709;&#x8981;&#x6C42;&#xFF1A;<br><span> </span>1&#x300B;&#x5FC5;&#x987B;&#x662F;static&#x7C7B;&#x578B;<br><span> </span>2&#x300B;&#x65B9;&#x6CD5;&#x53EA;&#x5141;&#x8BB8;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;String&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x5C31;&#x662F;&#x6253;&#x5370;&#x7684;&#x65E5;&#x5FD7;tag<br><span> </span>3&#x300B;&#x65B9;&#x6CD5;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x6307;&#x5B9A;&#xFF0C;&#x4F46;&#x662F;&#x5FC5;&#x987B;&#x5728;icodetools.bat&#x4E2D;&#x4FDD;&#x6301;&#x4E00;&#x81F4;<br><span> </span>&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7684;&#x65B9;&#x6CD5;&#x6A21;&#x677F;&#x4E3A;: public static XXX YYY(String tag)<br><span> </span>&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x53D8;&#x52A8;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x548C;icodetools.bat&#x4E2D;&#x4FDD;&#x6301;&#x4E00;&#x81F4;</span></p><p><span>4&#x3001;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x7684;libs&#x76EE;&#x5F55;&#x4E2D;&#x662F;&#x5DE5;&#x5177;&#x4F9D;&#x8D56;&#x7684;jar&#x5305;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x968F;&#x4FBF;&#x4FEE;&#x6539;</span></p><p><span>5&#x3001;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x7684;JWUtils.java&#x6587;&#x4EF6;&#x540D;&#x548C;&#x5305;&#x540D;&#x90FD;&#x4E0D;&#x53EF;&#x53D8;&#x52A8;</span></p><p><span>6&#x3001;cyy_game.keystore&#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x540D;&#x4E0D;&#x53EF;&#x8FDB;&#x884C;&#x4FEE;&#x6539;</span></p><p><span>7&#x3001;&#x5982;&#x679C;&#x60F3;&#x81EA;&#x5DF1;&#x518D;&#x6B21;&#x7B7E;&#x540D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;unsigned.apk&#x6587;&#x4EF6;&#x64CD;&#x4F5C;&#xFF0C;signed.apk&#x662F;&#x4F7F;&#x7528;&#x4E86;cyy_game.keystore&#x6587;&#x4EF6;&#x7B7E;&#x540D;</span></p><p><span>8&#x3001;&#x5728;icodetools.bat&#x4E2D;&#x9700;&#x8981;&#x624B;&#x52A8;&#x8BBE;&#x7F6E;aapt&#x547D;&#x4EE4;&#x7684;&#x8DEF;&#x5F84;</span></p><p><span>9&#x3001;&#x5DE5;&#x5177;&#x8FD0;&#x884C;&#x524D;&#x5FC5;&#x987B;&#x914D;&#x7F6E;JAVA_HOME&#x73AF;&#x5883;&#x53D8;&#x91CF;</span></p><p><span>10&#x3001;&#x73B0;&#x9636;&#x6BB5;&#x53EA;&#x652F;&#x6301;JDK1.7&#x4EE5;&#x53CA;&#x4EE5;&#x4E0B;&#x7248;&#x672C;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x4E0D;&#x652F;&#x6301;1.8&#x4EE5;&#x53CA;&#x4EE5;&#x4E0A;&#x7684;<br></span></p><p><strong><span><span>&#x6CE8;&#x610F;&#xFF1A;</span>&#x5DE5;&#x5177;&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x4E24;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;icodetools_1.0.bat&#xFF0C;&#x4E00;&#x4E2A;&#x662F;icodetools_2.0.bat&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5DE5;&#x5177;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x517C;&#x5BB9;&#x66F4;&#x591A;&#x7684;apk&#xFF0C;&#x9ED8;&#x8BA4;&#x6700;&#x597D;&#x5148;&#x91C7;&#x7528;icodetools_1.0.bat&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x5C1D;&#x8BD5;&#xFF0C;&#x5931;&#x8D25;&#x4E86;&#x53EF;&#x4EE5;&#x5728;&#x4F7F;&#x7528;icodetools_2.0.bat&#x5DE5;&#x5177;&#xFF0C;&#x5982;&#x679C;&#x90FD;&#x5931;&#x8D25;&#x4E86;&#x90A3;&#x5C31;&#x8981;&#x53CD;&#x9988;&#x95EE;&#x9898;&#x7ED9;&#x6211;&#x4E86;&#xFF01;</span></strong></p><h1><span>&#x4E5D;&#x3001;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#x5E38;&#x89C1;&#x95EE;&#x9898;</span></h1><p><strong><span>&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<span>Uncaught translation error: com.android.dx.cf.code.SimException</span></span></strong></p><p><span><img src="http://img.blog.csdn.net/20161202160212440?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x56E0;&#x4E3A;&#x5DE5;&#x5177;&#x7248;&#x672C;&#x4E0D;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;icodetools_1.0.bat&#x64CD;&#x4F5C;&#x6709;&#x95EE;&#x9898;&#x5177;&#x4F7F;&#x7528;icodetools_2.0.bat&#x5DE5;&#x5177;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;icodetools_2.0.bat&#x5DE5;&#x5177;&#x64CD;&#x4F5C;&#x6709;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x7528;icodetools_1.0.bat&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5DE5;&#x5177;&#x90FD;&#x6709;&#x95EE;&#x9898;&#x90A3;&#x5C31;&#x662F;&#x771F;&#x7684;&#x6709;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x8BB0;&#x5F97;&#x7ED9;&#x6211;&#x53CD;&#x9988;&#xFF01;</span></p><p><strong><span>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<span>&#x62F7;&#x8D1D;&#x6587;&#x4EF6;&#x5931;&#x8D25;:java.io.FileNotFoundException: JWUtils.class</span></span></strong></p><p><span><img src="http://img.blog.csdn.net/20161202161606775?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5DE5;&#x5177;&#x5185;&#x90E8;&#x4F1A;&#x91C7;&#x7528;javac&#x7F16;&#x8BD1;JWUtils&#x7C7B;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x91CC;&#x5E94;&#x8BE5;&#x662F;&#x7F16;&#x8BD1;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x4E3A;JWUtils&#x8FD9;&#x4E2A;&#x7C7B;&#x6587;&#x4EF6;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x548C;&#x8BED;&#x6CD5;&#x683C;&#x5F0F;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x89E3;&#x51B3;&#x7248;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;javac&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x770B;&#x770B;&#x5177;&#x4F53;&#x662F;&#x54EA;&#x91CC;&#x7F16;&#x8BD1;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x3002;</span></p><p><strong><span>&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<span>bad class file magic (cafebabe) or version (0034.0000)</span></span></strong></p><p><span><img src="http://img.blog.csdn.net/20161202162233293?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""><br></span></p><p><span>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x56E0;&#x4E3A;javac&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x662F;1.7&#x4EE5;&#x4E0A;&#x7248;&#x672C;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;JDK&#x7248;&#x672C;&#x3002;&#x4F46;&#x662F;&#x6B64;&#x5DE5;&#x5177;&#x73B0;&#x5728;&#x53EA;&#x652F;&#x6301;JDK1.8&#x7248;&#x672C;&#x4EE5;&#x4E0B;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x8BBE;&#x7F6E;JDK&#x7248;&#x672C;&#x3002;</span></p><p><strong><span>&#x7B2C;&#x56DB;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<span>&#x6210;&#x529F;&#x6CE8;&#x5165;&#x4EE3;&#x7801;&#x5B89;&#x88C5;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#x65E0;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;</span></span></strong></p><p><span>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x65E5;&#x5FD7;&#x7684;tag&#x662F;&#x5426;&#x6B63;&#x786E;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x67E5;&#x770B;icodetools.bat&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6267;&#x884C;&#x547D;&#x4EE4;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x4E3A;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5F00;&#x59CB;&#x65E5;&#x5FD7;&#x5F00;&#x5173;&#x662F;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD8;&#x5F97;&#x624B;&#x52A8;&#x6253;&#x5F00;&#xFF0C;&#x9996;&#x5148;&#x5F97;&#x53BB;/data/local/tmp&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;echo &quot;-s 1&quot; &gt;log.txt&#xFF0C;&#x6253;&#x5F00;&#x65E5;&#x5FD7;&#x5373;&#x53EF;&#x3002;</span></p><p><span>&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#x5EFA;&#x8BAE;&#x90FD;&#x53EF;&#x4EE5;&#x63D0;&#x7ED9;&#x6211;&#xFF0C;&#x6211;&#x4F1A;&#x5C3D;&#x5FEB;&#x4FEE;&#x590D;&#xFF01;</span></p><p><strong><span>&#x5DE5;&#x5177;&#x4E0B;&#x8F7D;&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/fourbrother/icodetools" target="_blank">https://github.com/fourbrother/icodetools</a></span></strong></p><p><strong><span><span><span>&#x58F0;&#x660E;&#xFF1A;</span></span>&#x6709;&#x4EBA;&#x8BA4;&#x4E3A;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x7684;&#x624B;&#x75D2;&#x60F3;&#x7ACB;&#x9A6C;&#x4E0B;&#x8F7D;&#x5C1D;&#x8BD5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x8BF4;&#x8FD9;&#x8FD8;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x9762;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x624D;&#x662F;&#x91CD;&#x70B9;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x90FD;&#x9700;&#x8981;&#x53D1;&#x6325;&#x5176;&#x4F5C;&#x7528;&#x624D;&#x662F;&#x4E2A;&#x597D;&#x5DE5;&#x5177;&#xFF0C;&#x6240;&#x4EE5;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x4F1A;&#x5E26;&#x5927;&#x5BB6;&#x7528;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x6765;&#x7834;&#x89E3;&#x4E00;&#x4E9B;app&#xFF01;</span></strong></p><p><strong><span><span>&#x540E;&#x671F;&#x4F18;&#x5316;&#xFF1A;</span>&#x73B0;&#x9636;&#x6BB5;&#x6B64;&#x5DE5;&#x5177;&#x652F;&#x6301;Windows&#x7CFB;&#x7EDF;&#xFF0C;&#x540E;&#x7EED;&#x4F1A;&#x589E;&#x52A0;Mac&#x548C;Linux&#x7CFB;&#x7EDF;&#xFF0C;&#x73B0;&#x9636;&#x6BB5;&#x53EA;&#x652F;&#x6301;apk&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x7684;dex&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x5176;&#x4ED6;&#x76EE;&#x5F55;&#x4E0B;&#x7684;dex&#x6587;&#x4EF6;&#x5904;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x6709;&#x4E9B;apk&#x6B64;&#x5DE5;&#x5177;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF01;</span></strong></p><h1><strong><span>&#x5341;&#x3001;&#x603B;&#x7ED3;</span></strong></h1><p><span>&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x548B;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x624D;&#x7B97;&#x662F;&#x6BD4;&#x8F83;&#x5B8C;&#x6574;&#x7684;&#x80FD;&#x591F;&#x7528;&#x4E8E;&#x751F;&#x4EA7;&#x7684;&#x5DE5;&#x5177;&#x4E86;&#xFF0C;&#x4F46;&#x662F;<strong>&#x56E0;&#x4E3A;&#x662F;&#x672C;&#x4EBA;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x80AF;&#x5B9A;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#xFF0C;&#x4EE5;&#x53CA;&#x9700;&#x8981;&#x4F18;&#x5316;&#x6539;&#x5584;&#x7684;&#x5730;&#x65B9;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5148;&#x5C06;&#x6B64;&#x5DE5;&#x5177;&#x7684;&#x7B2C;&#x4E00;&#x7248;&#x672C;&#x7ED9;&#x51FA;&#xFF0C;&#x975E;&#x5E38;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;<strong>&#x5982;&#x679C;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x73B0;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8BB0;&#x5F97;&#x7ED9;&#x6211;&#x7559;&#x8A00;&#xFF0C;&#x6211;&#x4F1A;&#x7ACB;&#x5373;&#x4FEE;&#x590D;&#x548C;&#x6539;&#x5584;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x9760;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x8D21;&#x732E;&#x7684;&#x3002;&#x95EE;&#x9898;&#x53CD;&#x9988;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x5FAE;&#x4FE1;&#x79C1;&#x804A;&#x6211;&#x6216;&#x8005;&#x662F;&#x5728;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x7559;&#x8A00;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;</strong>&#xFF0C;&#x6211;&#x4F1A;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x56DE;&#x590D;&#xFF0C;&#x5148;&#x62DC;&#x8C22;&#x5404;&#x4F4D;&#x4F7F;&#x7528;&#x8005;&#x4E86;&#x3002;&#x5199;&#x4E86;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x540E;&#x5E76;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x56E0;&#x4E3A;<strong>&#x540E;&#x9762;&#x8FD8;&#x6709;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x4F55;&#x7528;&#x5B83;&#x6765;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5BFB;&#x627E;hook&#x70B9;</strong>&#x3002;&#x6587;&#x7AE0;&#x7B97;&#x662F;&#x5199;&#x5B8C;&#x4E86;&#xFF0C;&#x7CBE;&#x529B;&#x5374;&#x5168;&#x6CA1;&#x4E86;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x8EAB;&#x4F53;&#x88AB;&#x638F;&#x7A7A;&#x4E86;&#x4E00;&#x6837;&#xFF0C;&#x611F;&#x8C22;&#x5927;&#x5BB6;&#x591A;&#x591A;&#x70B9;&#x8D5E;&#xFF0C;&#x8981;&#x662F;&#x6709;&#x6253;&#x8D4F;&#x5C31;&#x5728;&#x597D;&#x4E0D;&#x8FC7;&#x4E86;&#xFF01;</span></p><p><span><span><span>&#x66F4;&#x591A;&#x5185;&#x5BB9;&#xFF1A;<span><a href="http://www.wjdiankong.cn/" target="_blank">&#x70B9;&#x51FB;&#x8FD9;&#x91CC;</a></span></span></span></span></p><p><span><strong><span>&#x5173;&#x6CE8;<a href="http://lib.csdn.net/base/wechat" target="_blank">&#x5FAE;&#x4FE1;</a>&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x6700;&#x65B0;&#x6280;&#x672F;&#x5E72;&#x8D27;&#x5B9E;&#x65F6;&#x63A8;&#x9001;</span></strong></span></p><div><span><img src="http://img.blog.csdn.net/20160822091821005?watermark/2/text/aHR0cDovL2Jsb2cuY3Nkbi5uZXQv/font/5a6L5L2T/fontsize/400/fill/I0JBQkFCMA==/dissolve/70/gravity/Center" alt=""></span></div><span> </span></div>