<p> </p><p> </p><div><span> </span><p> &#x5BF9;&#x4E8E;SQL Server&#x7528;&#x6237;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;Windows Azure SQL Database(&#x539F;&#x540D;SQL Azure)&#x8FD9;&#x4E00;&#x5FAE;&#x8F6F;&#x7684;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x9664;&#x4E86;SQL Database&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5173;&#x7CFB;&#x578B;&#x6216;&#x8005;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E91;&#x670D;&#x52A1;&#x3002;&#x5728;&#x672C;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5C06;&#x4E3A;&#x60A8;&#x603B;&#x7ED3;&#x4E94;&#x6B3E;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E91;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x60A8;&#x7684;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x3002;</p><span> </span><p> <img alt="" src="/UploadFiles/Document/201504/20/20150420092530982199.JPG"></p><span> </span><p> <strong>&#x4E9A;&#x9A6C;&#x900A;AWS</strong></p><span> </span><p> &#x4E9A;&#x9A6C;&#x900A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;(RDS)&#x662F;&#x6700;&#x65E9;&#x4E00;&#x6279;&#x57FA;&#x4E8E;&#x4E91;&#x7684;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x7531;Amazon Web Services(AWS)&#x63D0;&#x4F9B;&#x7684;&#x9996;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3002;&#x5728;RDS&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;Oracle&#x3001;MySQL&#x6216;&#x662F;SQL Server&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#xFF0C;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x5B58;&#x50A8;&#x6216;&#x662F;Provisional IOPS&#x5B58;&#x50A8;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x8FD8;&#x9488;&#x5BF9;I/O&#x5BC6;&#x96C6;&#x578B;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#x3002;RDS&#x8FD8;&#x7ED9;&#x4F60;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E9A;&#x9A6C;&#x900A;&#x865A;&#x62DF;&#x79C1;&#x6709;&#x4E91;&#x670D;&#x52A1;&#x6765;&#x9694;&#x79BB;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x4E9A;&#x9A6C;&#x900A;CloudWatch Service&#x6765;&#x67E5;&#x770B;&#x5B9E;&#x4F8B;&#x7684;&#x5173;&#x952E;&#x8FD0;&#x884C;&#x6307;&#x6807;&#x3002;</p><span> </span><p> &#x5F53;&#x7136;AWS&#x4E5F;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#xFF0C;&#x5305;&#x62EC; DynamoDB&#x3001;Redshift&#x4EE5;&#x53CA;SimpleDB,&#x5B83;&#x4EEC;&#x76EE;&#x524D;&#x90FD;&#x662F;&#x4F5C;&#x4E3A;&#x516C;&#x5171;&#x6D4B;&#x8BD5;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x7684;&#x3002;DynamoDB&#x662F;&#x4E00;&#x4E2A;NoSQL&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5176;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x4E0A;&#x7684;&#x5E76;&#x590D;&#x5236;&#x5230;&#x4E09;&#x4E2A;&#x53EF;&#x7528;&#x7AD9;&#x70B9;&#xFF0C;&#x8FD9;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x800C;&#x4E14;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x3002;Redshift&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x5217;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x7ED3;&#x5408;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x5E76;&#x884C;&#x67E5;&#x8BE2;&#x6240;&#x652F;&#x6301;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8303;&#x56F4;&#x4ECE;GB&#x7EA7;&#x522B;&#x5230;PB&#x7EA7;&#x522B;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x800C;SimpleDB&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5173;&#x7CFB;&#x578B;&#xFF0C;&#x975E;&#x6A21;&#x5F0F;&#x5316;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x67E5;&#x8BE2;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5C0F;&#x5B57;&#x7B26;&#x6570;&#x636E;&#x96C6;&#x3002;</p><span> </span><p> &#x9664;&#x4E86;&#x4EE5;&#x4E0A;&#x56DB;&#x9879;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;AWS&#x8FD8;&#x4E3A;&#x8FC1;&#x79FB;&#x548C;&#x5904;&#x7406;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x4E86;Data Pipeline(&#x6570;&#x636E;&#x7BA1;&#x9053;)&#x5DE5;&#x4F5C;&#x6D41;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x7684;ElastiCache&#x670D;&#x52A1;&#x3002;</p><span> </span><p> <strong>&#x8C37;&#x6B4C;&#x4E91;&#x5E73;&#x53F0;</strong></p><span> </span><p> &#x548C; Amazon&#x4E00;&#x6837;&#xFF0C;Google&#x63D0;&#x4F9B;&#x591A;&#x79CD;&#x6570;&#x636E;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x3002;&#x9996;&#x5148;&#x662F;Cloud SQL,&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;MySQL&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;SQL Azure&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#x3002;Cloud SQL&#x662F;&#x4E0E;App Engine&#x548C;&#x5176;&#x4ED6;Google&#x670D;&#x52A1;&#x5168;&#x9762;&#x800C;&#x7D27;&#x5BC6;&#x96C6;&#x6210;&#x7684;&#x3002;Cloud SQL&#x8FD8;&#x652F;&#x6301;&#x540C;&#x6B65;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x7AD9;&#x70B9;&#x3002;&#x6B64;&#x5916;&#xFF0C;Google&#x8FD8;&#x63D0;&#x4F9B;BigQuery&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x65F6;&#x5927;&#x6570;&#x636E;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5BF9;&#x6570;&#x5341;&#x4EBF;&#x6761;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x96C6;&#x6267;&#x884C;&#x968F;&#x673A;&#x67E5;&#x8BE2;&#x3002;&#x6B64;&#x670D;&#x52A1;&#x5229;&#x7528;Google&#x7684;&#x5E9E;&#x5927;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x6765;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;TB&#x7EA7;&#x522B;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5206;&#x6790;&#x6570;&#x636E;&#x3002;</p><span> </span><p> Google&#x4EA7;&#x54C1;&#x5BB6;&#x65CF;&#x7684;&#x6700;&#x65B0;&#x6210;&#x5458;Cloud Datastore,&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x6A21;&#x5F0F;&#x5316;&#xFF0C;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x652F;&#x6301;ACID&#x4E8B;&#x52A1;&#xFF0C;&#x4E0E;&#x90A3;&#x4E9B;&#x5728;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;(RDBMS)&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x3002; ACID&#x6307;&#x7684;&#x662F;&#x7528;&#x4E8E;&#x4FDD;&#x8BC1;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#x548C;&#x5B89;&#x5168;&#x4E8B;&#x52A1;&#x7684;&#x56DB;&#x4E2A;&#x5C5E;&#x6027;&#xFF1A;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x9694;&#x79BB;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x3002;Cloud Datastore&#x670D;&#x52A1;&#x76EE;&#x524D;&#x63D0;&#x4F9B;&#x6709;&#x4E00;&#x4E2A;&#x9884;&#x89C8;&#x7248;&#x5E76;&#x4E14;App Engine&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x76F8;&#x540C;&#x7684;Datastore&#x5B58;&#x50A8;&#x3002;Datastore&#x662F;&#x4F5C;&#x4E3A;Google&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;BigTable&#x7684;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x3002; Datastore&#x6570;&#x636E;&#x5219;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5E76;&#x968F;&#x7740;&#x6D41;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x81EA;&#x52A8;&#x6269;&#x5BB9;&#x3002;</p><span> </span><p> <strong>Rackspace&#x4E91;&#x6570;&#x636E;&#x5E93;</strong></p><span> </span><p> Rackspace &#x63D0;&#x4F9B;&#x7684;&#x4F17;&#x591A;&#x57FA;&#x4E8E;&#x4E91;&#x7684;&#x670D;&#x52A1;&#x4E2D;&#xFF0C;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3002;&#x8BF8;&#x5982;MongoLab&#x548C;Cloudant&#x4E4B;&#x7C7B;&#x7684;&#x516C;&#x53F8;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x7F51;&#x5173;&#x670D;&#x52A1;&#x4E5F;&#x5C06;Rackspace&#x8986;&#x76D6;&#x5728;&#x5176;&#x4EA7;&#x54C1;&#x4E4B;&#x4E2D;&#x3002;&#x6B64;&#x5916;&#xFF0C;Rackspace&#x8FD8;&#x4E3A;MySQL&#x3001;Oracle&#x548C;SQL Server&#x63D0;&#x4F9B;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x3002;&#x4E13;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x548C;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x4E3A;&#x4F60;&#x8BBE;&#x8BA1;&#x57FA;&#x4E8E;&#x4E91;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5E76;&#x7BA1;&#x7406;&#x8F6F;&#x786C;&#x4EF6;&#x4E14;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x5168;&#x9762;&#x652F;&#x6301;&#x3002;</p><span> </span><p> Rackspace &#x5982;&#x4ECA;&#x4E5F;&#x63D0;&#x4F9B;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5EFA;&#x7ACB;&#x5728;OpenStack&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5168;&#x9762;&#x7BA1;&#x7406;&#x7684;MySQL&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x3002;OpenStack&#x662F;&#x7531;Rackspace&#x548C;NASA &#x5F00;&#x53D1;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x5F00;&#x653E;&#x6807;&#x51C6;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5EFA;&#x7ACB;&#x516C;&#x6709;&#x4E91;&#x548C;&#x79C1;&#x6709;&#x4E91;&#x3002;Rackspace&#x4E91;&#x6570;&#x636E;&#x5E93;&#x540C;&#x6837;&#x4F7F;&#x7528;&#x6709;&#x5185;&#x7F6E;&#x6570;&#x636E;&#x590D;&#x5236;&#x7684;SAN&#x5B58;&#x50A8;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x5BB9;&#x5668;&#x7684;&#x865A;&#x62DF;&#x5316;&#x7ED3;&#x6784;&#x4E2D;&#x52A0;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x6BD4;&#x4F20;&#x7EDF;&#x786C;&#x4EF6;&#x865A;&#x62DF;&#x5316;&#x8868;&#x73B0;&#x7684;&#x66F4;&#x597D;&#x3002;&#x6709;&#x4E86;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x90E8;&#x7F72;&#xFF0C;&#x914D;&#x7F6E;&#x548C;&#x6253;&#x8865;&#x4E01;&#x90FD;&#x662F;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x7684;&#x3002;</p><span> </span><p> <strong>MongoLab</strong></p><span> </span><p> MongoLab &#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x662F;&#x57FA;&#x4E8E;MongoDB&#x6570;&#x636E;&#x5E93;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#xFF0C;&#x9762;&#x5411;&#x6587;&#x6863;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;&#x4E0E;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x56FA;&#x5B9A;&#x7684;&#x6A21;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;MongoDB&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x56E0;&#x6587;&#x6863;&#x800C;&#x4E0D;&#x540C;&#x5E76;&#x4E14;&#x4F1A;&#x968F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6F14;&#x8FDB;&#x800C;&#x6539;&#x53D8;&#x3002;&#x4F46;&#x662F;&#xFF0C;MongoDB&#x4ECD;&#x7136;&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53EF;&#x7528;&#x7684;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x8BF8;&#x5982;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x3002;</p><span> </span><p> MongoLab&#x5C06;MongoDB&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7F51;&#x5173;&#x670D;&#x52A1;&#x52A0;&#x4EE5;&#x63D0;&#x4F9B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6258;&#x7BA1;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4E91;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x5305;&#x62EC; AWS,Joyent,Rackspace,Windows Azure&#x4EE5;&#x53CA;Google Cloud Platform.&#x6B64;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x6267;&#x884C;&#x81EA;&#x52A8;&#x5907;&#x4EFD;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7EDC;&#x4E0A;&#x6216;&#x662F;&#x4E00;&#x4E2A;&#x4E91;&#x5B58;&#x50A8;&#x63D0;&#x4F9B;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x7F51;&#x7EDC;&#x4E0A;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x3002;MongoDB&#x8FD8;&#x63D0;&#x4F9B;&#x4E00;&#x7EC4;&#x57FA;&#x4E8E;Web&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x8FDB;&#x884C;&#x8BF8;&#x5982;&#x6267;&#x884C;&#x4E00;&#x822C;&#x641C;&#x7D22;&#xFF0C;&#x63A7;&#x5236;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6216;&#x662F;&#x4F18;&#x5316;&#x67E5;&#x8BE2;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6B64;&#x5916;&#xFF0C;MongoLab&#x4F1A;&#x4E0D;&#x95F4;&#x65AD;&#x76D1;&#x63A7;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#x548C;&#x6027;&#x80FD;&#x3002;</p><span> </span><p> <strong>Datbase.com</strong></p><span> </span><p> Salesforce.com&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3002;Datbase.com&#x4F7F;&#x7528;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x6280;&#x672F;&#x6765;&#x5F3A;&#x5316; Salesforce&#x5BA2;&#x6237;&#x5173;&#x7CFB;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x8D85;&#x8FC7;&#x6BCF;&#x5929;50&#x4EBF;&#x7684;&#x4E8B;&#x52A1;&#x3002;Database.com&#x662F;&#x57FA;&#x4E8E;&#x591A;&#x79DF;&#x6237;&#x67B6;&#x6784;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x5B83;&#x91CC;&#x9762;&#x8BF8;&#x5982;&#x7F13;&#x5B58;&#xFF0C;&#x7CFB;&#x7EDF;&#x76EE;&#x5F55;&#x4EE5;&#x53CA;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x90FD;&#x662F;&#x5171;&#x4EAB;&#x7684;&#x3002;</p><span> </span><p> &#x5C3D;&#x7BA1;Database.com&#x63D0;&#x4F9B;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5176;&#x67B6;&#x6784;&#x4E5F;&#x4E0D;&#x540C;&#x4E8E;&#x5178;&#x578B;&#x7684; RDBMS.Database.com&#x4F7F;&#x7528;&#x4E13;&#x95E8;&#x8BBE;&#x8BA1;&#x7684;&#x6A21;&#x5F0F;&#x6765;&#x5EFA;&#x7ACB;&#x591A;&#x79DF;&#x6237;&#x548C;&#x4E91;&#x73AF;&#x5883;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x800C;&#x8FD9;&#x662F;&#x6258;&#x7BA1;&#x7CFB;&#x7EDF;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6B64;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x65F6;&#x5F15;&#x64CE;&#x4ECE;&#x5143;&#x6570;&#x636E;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x5F15;&#x64CE;&#x3001;&#x5143;&#x6570;&#x636E;&#x548C;&#x79DF;&#x6237;&#x6570;&#x636E;&#x5404;&#x81EA;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x3002;</p><span> </span><p> Cloudant,Couchbase&#x548C; Garantia Data&#x7B49;&#x516C;&#x53F8;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x5C3D;&#x7BA1;Amazon&#x548C;Google&#x5728;&#x591A;&#x6837;&#x5316;&#x4E0A;&#x5C45;&#x4E8E;&#x9886;&#x5148;&#x5730;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5C31;&#x9002;&#x5408;&#x4F60;&#x7684;&#x4F01;&#x4E1A;&#x3002; Rackspace Cloud Database&#x3001;MongoLab&#x4EE5;&#x53CA;Database.com&#x90FD;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x63A8;&#x8350;&#x7684;&#x4E91;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3002;</p><span> </span></div>