<div><span> </span><p> &#x65B0;&#x534E;&#x7F51;&#x5317;&#x4EAC;5&#x6708;12&#x65E5;&#x7535; (&#x8BB0;&#x8005;&#x7F57;&#x6C99;)<a href="http://country.huanqiu.com/china" target="_blank">&#x4E2D;&#x56FD;</a>&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x5C40;12&#x65E5;&#x7EC4;&#x7EC7;&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x73AF;&#x5883;&#x9884;&#x62A5;&#x4E2D;&#x5FC3;&#x7B49;&#x6D77;&#x6D0B;&#x90E8;&#x95E8;&#x4E3E;&#x884C;2013&#x5E74;&#x6D77;&#x5578;&#x6F14;&#x4E60;&#xFF0C;&#x8BC4;&#x4F30;&#x4E0E;&#x68C0;&#x9A8C;&#x5404;&#x7EA7;&#x6D77;&#x6D0B;&#x9884;&#x62A5;&#x673A;&#x6784;&#x7684;&#x6D77;&#x5578;&#x4FE1;&#x606F;&#x63A5;&#x6536;&#x3001;&#x9884;&#x8B66;&#x4EA7;&#x54C1;&#x5236;&#x4F5C;&#x4E0E;&#x5206;&#x53D1;&#x80FD;&#x529B;&#x4EE5;&#x53CA;&#x6D77;&#x6D0B;&#x4E3B;&#x7BA1;&#x90E8;&#x95E8;&#x7684;&#x5E94;&#x6025;&#x5904;&#x7F6E;&#x80FD;&#x529B;&#x3002;</p><span> </span><p> &#x672C;&#x6B21;&#x6D77;&#x5578;&#x6F14;&#x4E60;&#x603B;&#x6307;&#x6325;&#x90E8;&#x8BBE;&#x5728;&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x73AF;&#x5883;&#x9884;&#x62A5;&#x4E2D;&#x5FC3;&#x4F1A;&#x5546;&#x5BA4;&#xFF0C;&#x6F14;&#x4E60;&#x5DE5;&#x4F5C;&#x73B0;&#x573A;&#x8BBE;&#x5728;&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x73AF;&#x5883;&#x9884;&#x62A5;&#x4E2D;&#x5FC3;&#x6D77;&#x5578;&#x9884;&#x8B66;&#x5DE5;&#x4F5C;&#x5E73;&#x53F0;&#xFF0C;&#x6F14;&#x4E60;&#x5168;&#x7A0B;&#x5229;&#x7528;&#x5168;&#x56FD;&#x6D77;&#x6D0B;&#x9884;&#x62A5;&#x8FDC;&#x7A0B;&#x89C6;&#x9891;&#x4F1A;&#x5546;&#x7CFB;&#x7EDF;&#x5F00;&#x5C55;&#xFF0C;&#x6DB5;&#x76D6;&#x6D77;&#x5578;&#x9884;&#x8B66;&#x4FE1;&#x606F;&#x5236;&#x4F5C;&#x5206;&#x53D1;&#x4EE5;&#x53CA;&#x6D77;&#x5578;&#x5E94;&#x6025;&#x54CD;&#x5E94;&#x51B3;&#x7B56;&#x670D;&#x52A1;&#x7B49;&#x73AF;&#x8282;&#x3002;</p><span> </span><p> &#x6F14;&#x4E60;&#x6A21;&#x62DF;&#x5317;&#x4EAC;&#x65F6;&#x95F4;2013&#x5E74;5&#x6708;12&#x65E5;13&#x65F6;50&#x5206;&#xFF0C;&#x5728;<a href="http://country.huanqiu.com/philippines" target="_blank">&#x83F2;&#x5F8B;&#x5BBE;</a>&#x4EE5;&#x897F;&#x6D77;&#x57DF;&#x53D1;&#x751F;9.0&#x7EA7;&#x6D77;&#x5E95;&#x5730;&#x9707;&#xFF0C;&#x5F15;&#x53D1;&#x7279;&#x5927;&#x6D77;&#x5578;&#x3002;&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x9884;&#x62A5;&#x53F0;&#x63A5;&#x6536;&#x5230;&#x5730;&#x9707;&#x4FE1;&#x606F;&#x540E;&#xFF0C;&#x7ACB;&#x5373;&#x5F00;&#x5C55;&#x6D77;&#x5578;&#x8FC7;&#x7A0B;&#x5BF9;&#x4E2D;&#x56FD;&#x7684;&#x5F71;&#x54CD;&#x5206;&#x6790;&#xFF0C;&#x5E76;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x5C06;&#x6D77;&#x5578;&#x8B66;&#x62A5;&#x5411;&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x5C40;&#x6C47;&#x62A5;&#x3002;</p><span> </span><p> &#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x5C40;&#x7ACB;&#x5373;&#x7EC4;&#x7EC7;&#x6709;&#x5173;&#x90E8;&#x95E8;&#x542F;&#x52A8;&#x5E94;&#x6025;&#x54CD;&#x5E94;&#xFF0C;&#x8FC5;&#x901F;&#x5C06;&#x6D77;&#x5578;&#x8B66;&#x62A5;&#x53D1;&#x9001;&#x81F3;&#x53D7;&#x6D77;&#x5578;&#x5F71;&#x54CD;&#x7684;&#x6CBF;&#x6D77;&#x5404;&#x5730;&#x3002;&#x5404;&#x7EA7;&#x6D77;&#x6D0B;&#x9884;&#x62A5;&#x673A;&#x6784;&#x5747;&#x9488;&#x5BF9;&#x76F8;&#x5173;&#x6D77;&#x57DF;&#x5185;&#x7684;&#x6838;&#x7535;&#x3001;&#x6E2F;&#x53E3;&#x3001;&#x4EA4;&#x901A;&#x3001;&#x77F3;&#x5316;&#x3001;&#x4ED3;&#x50A8;&#x7B49;&#x91CD;&#x70B9;&#x4FDD;&#x969C;&#x76EE;&#x6807;&#x5F00;&#x5C55;&#x4E86;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x6D77;&#x5578;&#x9884;&#x8B66;&#x5DE5;&#x4F5C;&#x3002;</p><span> </span><p> &#x968F;&#x540E;&#xFF0C;&#x56FD;&#x5BB6;&#x6D77;&#x6D0B;&#x9884;&#x62A5;&#x53F0;&#x5BC6;&#x5207;&#x8DDF;&#x8E2A;&#x6D77;&#x5578;&#x53D1;&#x5C55;&#x52A8;&#x6001;&#xFF0C;&#x5728;&#x786E;&#x8BA4;&#x672C;&#x6B21;&#x6D77;&#x5578;&#x8FC7;&#x7A0B;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x53D1;&#x5E03;&#x4E86;&#x6D77;&#x5578;&#x8B66;&#x62A5;&#x89E3;&#x9664;&#x901A;&#x62A5;&#x3002;</p><span> </span><p> &#x6B64;&#x6B21;&#x6F14;&#x4E60;&#x662F;<a href="http://country.huanqiu.com/unesco" target="_blank">&#x8054;&#x5408;&#x56FD;&#x6559;&#x79D1;&#x6587;&#x7EC4;&#x7EC7;</a>&#x653F;&#x5E9C;&#x95F4;&#x6D77;&#x6D0B;&#x5B66;&#x59D4;&#x5458;&#x4F1A;(IOC&#xFF0F;UNESCO)&#x5728;&#x6574;&#x4E2A;&#x592A;&#x5E73;&#x6D0B;&#x533A;&#x57DF;&#x53D1;&#x8D77;&#x7684;&#x4EE3;&#x53F7;&#x4E3A;&#x201C;Exercise Pacific Wave 13&#x201D;&#x7684;&#x8DE8;&#x56FD;&#x6D77;&#x5578;&#x6F14;&#x4E60;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8BE5;&#x8DE8;&#x56FD;&#x6D77;&#x5578;&#x6F14;&#x4E60;&#x4E8E;&#x4ECA;&#x5E74;5&#x6708;1&#x65E5;&#x81F3;14&#x65E5;&#x5728;&#x6574;&#x4E2A;&#x592A;&#x5E73;&#x6D0B;&#x5730;&#x533A;&#x4E3E;&#x884C;&#x3002;&#x8FD9;&#x662F;&#x4E2D;&#x56FD;&#x4F5C;&#x4E3A;&#x592A;&#x5E73;&#x6D0B;&#x6D77;&#x5578;&#x9884;&#x8B66;&#x7CFB;&#x7EDF;&#x6210;&#x5458;&#x56FD;&#xFF0C;&#x7B2C;&#x56DB;&#x6B21;&#x53C2;&#x4E0E;&#x8BE5;&#x7EC4;&#x7EC7;&#x53D1;&#x8D77;&#x7684;&#x6CDB;&#x592A;&#x5E73;&#x6D0B;&#x533A;&#x57DF;&#x5927;&#x89C4;&#x6A21;&#x8DE8;&#x56FD;&#x6D77;&#x5578;&#x6F14;&#x4E60;&#x3002;</p><span> </span><span> </span><p><strong>&#x514D;&#x8D23;&#x58F0;&#x660E;&#xFF1A;</strong>&#x672C;&#x6587;&#x4EC5;&#x4EE3;&#x8868;&#x4F5C;&#x8005;&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;&#xFF0C;&#x4E0E;&#x73AF;&#x7403;&#x7F51;&#x65E0;&#x5173;&#x3002;&#x5176;&#x539F;&#x521B;&#x6027;&#x4EE5;&#x53CA;&#x6587;&#x4E2D;&#x9648;&#x8FF0;&#x6587;&#x5B57;&#x548C;&#x5185;&#x5BB9;&#x672A;&#x7ECF;&#x672C;&#x7AD9;&#x8BC1;&#x5B9E;&#xFF0C;&#x5BF9;&#x672C;&#x6587;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x5168;&#x90E8;&#x6216;&#x8005;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3001;&#x6587;&#x5B57;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x3001;&#x5B8C;&#x6574;&#x6027;&#x3001;&#x53CA;&#x65F6;&#x6027;&#x672C;&#x7AD9;&#x4E0D;&#x4F5C;&#x4EFB;&#x4F55;&#x4FDD;&#x8BC1;&#x6216;&#x627F;&#x8BFA;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x4EC5;&#x4F5C;&#x53C2;&#x8003;&#xFF0C;&#x5E76;&#x8BF7;&#x81EA;&#x884C;&#x6838;&#x5B9E;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x3002;</p><span> </span><span> </span></div>