<div><span> </span><div><span> </span><h2>&#x82F9;&#x679C;&#x8981;&#x628A;&#x5DE5;&#x5382;&#x642C;&#x56DE;&#x7F8E;&#x56FD;&#xFF1F;&#x8D70;&#x597D;&#x4E0D;&#x9001;&#xFF01;</h2><span> </span><p>&#x636E;&#x6089;&#xFF0C;&#x82F9;&#x679C;&#x4ECE;&#x4ECA;&#x5E74;6&#x6708;&#x5DF2;&#x7ECF;&#x79D8;&#x5BC6;&#x5F00;&#x59CB;&#x5728;&#x5168;&#x7403;&#x5404;&#x5927;&#x4EE3;&#x5DE5;&#x5382;&#x5C55;&#x5F00;&#x8C03;&#x67E5;&#xFF0C;&#x5BFB;&#x627E;&#x5C06;iPhone&#x7EC4;&#x88C5;&#x751F;&#x4EA7;&#x7EBF;&#x642C;&#x56DE;&#x7F8E;&#x56FD;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p><span> </span><dl> <span>&#x4F5C;&#x8005;&#xFF1A;&#x4E8C;&#x864E;</span>|<em>2016-11-21 20:11</em> <dd> </dd> </dl><span> </span></div><span> </span><div><span> </span><h2><a href="http://zhuanlan.51cto.com/#" target="_blank"></a></h2><span> </span><p>&#x636E;&#x6089;&#xFF0C;&#x82F9;&#x679C;&#x4ECE;&#x4ECA;&#x5E74;6&#x6708;&#x5DF2;&#x7ECF;&#x79D8;&#x5BC6;&#x5F00;&#x59CB;&#x5728;&#x5168;&#x7403;&#x5404;&#x5927;&#x4EE3;&#x5DE5;&#x5382;&#x5C55;&#x5F00;&#x8C03;&#x67E5;&#xFF0C;&#x5BFB;&#x627E;&#x5C06;iPhone&#x7EC4;&#x88C5;&#x751F;&#x4EA7;&#x7EBF;&#x642C;&#x56DE;&#x7F8E;&#x56FD;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p><span> </span><p>&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x5728;&#x4E0A;&#x5468;&#x672B;&#x88AB;&#x900F;&#x9732;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5BCC;&#x58EB;&#x5EB7;&#x4E0E;&#x548C;&#x7855;&#x8FD9;&#x4E24;&#x5BB6;&#x6700;&#x5927;&#x7684;&#x4E2D;&#x56FD;&#x4EE3;&#x5DE5;&#x5382;&#x5206;&#x522B;&#x7ED9;&#x51FA;&#x4E86;&#x56DE;&#x5E94;&#xFF0C;&#x5BCC;&#x58EB;&#x5EB7;&#x79F0;&#x5E0C;&#x671B;&#x82F9;&#x679C;&#x614E;&#x91CD;&#x8003;&#x8651;&#xFF0C;&#x56E0;&#x4E3A;&#x82F9;&#x679C;&#x7684;&#x505A;&#x6CD5;&#x4F1A;&#x8BA9;iPhone&#x7684;&#x6210;&#x672C;<strong>&#x201C;</strong><strong>&#x63D0;&#x9AD8;&#x4E00;&#x500D;</strong><strong>&#x201D;</strong>&#xFF0C;&#x800C;&#x548C;&#x7855;&#x5219;&#x660E;&#x786E;&#x8868;&#x793A;&#x5DF2;&#x7ECF;&#x62D2;&#x7EDD;&#x4E86;&#x82F9;&#x679C;&#x7684;&#x8981;&#x6C42;&#x3002;</p><span> </span><p>&#x4E5F;&#x6709;&#x6CA1;&#x9AA8;&#x6C14;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x590F;&#x666E;&#x5DF2;&#x7ECF;&#x8868;&#x793A;&#x5982;&#x679C;&#x82F9;&#x679C;&#x5F3A;&#x786C;&#x8981;&#x6C42;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x6DB2;&#x6676;&#x5C4F;&#x7684;&#x751F;&#x4EA7;&#x7EBF;&#x642C;&#x5230;&#x7F8E;&#x56FD;&#x3002;</p><span> </span><p>&#x6309;&#x7167;iPhone 7 32G&#x7248;&#x76EE;&#x524D;&#x7684;&#x5E73;&#x5747;&#x6210;&#x672C;225&#x7F8E;&#x5143;&#x8BA1;&#x7B97;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x7684;&#x653E;&#x5230;&#x7F8E;&#x56FD;&#x7EC4;&#x88C5;&#xFF0C;&#x6210;&#x672C;&#x5C06;&#x4F1A;&#x8FBE;&#x5230;450&#x7F8E;&#x5143;&#xFF0C;<strong>&#x6309;&#x7167;&#x82F9;&#x679C;&#x4E00;&#x8D2F;&#x7684;&#x5B9A;&#x4EF7;&#x7B56;&#x7565;&#xFF0C;&#x201C;&#x7F8E;&#x56FD;&#x5236;&#x9020;&#x201D;&#x7684;iPhone&#x5728;&#x4E2D;&#x56FD;&#x7684;&#x552E;&#x4EF7;&#x5C06;&#x8D85;&#x8FC7;&#x4E00;&#x4E07;&#x5143;</strong>&#xFF0C;&#x5728;iPhone&#x7684;&#x9500;&#x91CF;&#x548C;&#x5E02;&#x573A;&#x5360;&#x6709;&#x7387;&#x5DF2;&#x7ECF;&#x9010;&#x5E74;&#x4E0B;&#x6ED1;&#x7684;&#x8D8B;&#x52BF;&#x4E0B;&#xFF0C;&#x82F9;&#x679C;&#x8FD9;&#x6837;&#x505A;&#x65E0;&#x7591;&#x662F;&#x81EA;&#x5BFB;&#x6B7B;&#x8DEF;&#x3002;</p><span> </span><p>iPhone&#x7684;&#x82AF;&#x7247;&#x5728;&#x53F0;&#x6E7E;&#x751F;&#x4EA7;&#xFF0C;&#x663E;&#x793A;&#x5C4F;&#x5728;&#x65E5;&#x672C;&#x5236;&#x9020;&#xFF0C;&#x5185;&#x5B58;&#x662F;&#x5728;&#x97E9;&#x56FD;&#x548C;&#x65E5;&#x672C;&#xFF0C;&#x628A;&#x5728;&#x4E9A;&#x6D32;&#x751F;&#x4EA7;&#x7684;&#x5143;&#x4EF6;&#x5927;&#x8001;&#x8FDC;&#x7684;&#x8FD0;&#x56DE;&#x7F8E;&#x56FD;&#x7EC4;&#x88C5;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x72AF;&#x50BB;&#x5417;?</p><span> </span><p><a href="http://s1.51cto.com/wyfs02/M02/8A/87/wKiom1gy8-exhS9yAABQwUYnoNY793.jpg-wh_651x-s_2841820252.jpg" target="_blank"><img src="http://s1.51cto.com/wyfs02/M02/8A/87/wKiom1gy8-exhS9yAABQwUYnoNY793.jpg-wh_651x-s_2841820252.jpg" alt="&#x82F9;&#x679C;&#x8981;&#x628A;&#x5DE5;&#x5382;&#x642C;&#x56DE;&#x7F8E;&#x56FD;"></a></p><span> </span><p>&#x25B3;&#x5E93;&#x514B;14&#x5E74;&#x5E95;&#x8BBF;&#x95EE;&#x90D1;&#x5DDE;&#x5BCC;&#x58EB;&#x5EB7;&#x5DE5;&#x5382;&#x25B3;</p><span> </span><p>&#x82F9;&#x679C;&#x4E0D;&#x4EC5;&#x4E0D;&#x50BB;&#x800C;&#x4E14;&#x662F;&#x5168;&#x7403;&#x6700;&#x7CBE;&#x660E;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x82F9;&#x679C;&#x5728;&#x5168;&#x4E16;&#x754C;&#x7684;&#x7EC4;&#x88C5;&#x5DE5;&#x5382;&#x4E00;&#x5171;&#x6709;18&#x5BB6;&#xFF0C;&#x5176;&#x4E2D;&#x6709;14&#x5BB6;&#x4F4D;&#x4E8E;&#x4E2D;&#x56FD;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;<strong>&#x76F8;&#x6BD4;&#x4E8E;&#x4E16;&#x754C;&#x5176;&#x4ED6;&#x5730;&#x533A;&#xFF0C;&#x201C;&#x4E2D;&#x56FD;&#x5236;&#x9020;&#x201D;&#x65E9;&#x5DF2;&#x6210;&#x4E3A;&#x9AD8;&#x54C1;&#x8D28;&#x7535;&#x5B50;&#x4EA7;&#x54C1;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#xFF0C;</strong>&#x5373;&#x4FBF;&#x662F;&#x7F8E;&#x56FD;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x4FE1;&#x4EFB;&#x81EA;&#x5DF1;&#x4EBA;&#x751F;&#x4EA7;&#x7684;iPhone&#x3002;</p><span> </span><p><strong>&#x63A8;&#x7279;&#x4E0A;&#x6709;&#x4EBA;&#x9488;&#x5BF9;&#x6B64;&#x4E8B;&#x641E;&#x4E86;&#x8C03;&#x67E5;&#xFF0C;&#x95EE;&#x7F8E;&#x56FD;&#x4EBA;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x591A;&#x82B1;80&#x7F8E;&#x5143;&#x8D2D;&#x4E70;&#x201C;&#x7F8E;&#x56FD;&#x5236;&#x9020;&#x201D;&#x7684;iPhone&#xFF0C;55%&#x7684;&#x4EBA;&#x9009;&#x62E9;&#x4E86;&#x201C;&#x6CA1;&#x95E8;!&#x201D;</strong> &#x25BC;</p><span> </span><p><a href="http://s1.51cto.com/wyfs02/M00/8A/87/wKiom1gy8_rDo7X8AAA978knNoY628.jpg" target="_blank"><img src="http://s1.51cto.com/wyfs02/M00/8A/87/wKiom1gy8_rDo7X8AAA978knNoY628.jpg" alt="&#x82F9;&#x679C;&#x8981;&#x628A;&#x5DE5;&#x5382;&#x642C;&#x56DE;&#x7F8E;&#x56FD;"></a></p><span> </span><p>&#x8FD9;&#x80CC;&#x540E;&#x7684;&#x539F;&#x56E0;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7279;&#x6717;&#x666E;&#x7684;&#x7ADE;&#x9009;&#x7B56;&#x7565;&#xFF0C;&#x4ED6;&#x66FE;&#x591A;&#x6B21;&#x516C;&#x5F00;&#x8981;&#x6C42;&#x7F8E;&#x56FD;&#x4F01;&#x4E1A;&#x5C24;&#x5176;&#x662F;&#x82F9;&#x679C;&#x628A;&#x751F;&#x4EA7;&#x7EBF;&#x642C;&#x56DE;&#x7F8E;&#x56FD;&#x6765;&#x589E;&#x52A0;&#x672C;&#x571F;&#x5C31;&#x4E1A;&#x673A;&#x4F1A;&#xFF0C;&#x8FD9;&#x535A;&#x5F97;&#x4E86;&#x7F8E;&#x56FD;&#x9009;&#x6C11;&#x7684;&#x597D;&#x611F;&#x3002;</p><span> </span><p><a href="http://s5.51cto.com/wyfs02/M00/8A/84/wKioL1gy9AuS31XyAABswT-X-lU941.jpg" target="_blank"><img src="http://s5.51cto.com/wyfs02/M00/8A/84/wKioL1gy9AuS31XyAABswT-X-lU941.jpg" alt="&#x82F9;&#x679C;&#x8981;&#x628A;&#x5DE5;&#x5382;&#x642C;&#x56DE;&#x7F8E;&#x56FD;"></a></p><span> </span><p>&#x6B64;&#x5916;&#xFF0C;<strong>&#x7279;&#x6717;&#x666E;&#x5728;&#x7ADE;&#x9009;&#x65F6;&#x53EB;&#x56A3;&#x8981;&#x7ED9;&#x4E2D;&#x56FD;&#x751F;&#x4EA7;&#x7684;&#x5546;&#x54C1;&#x52A0;&#x4E0A;45%&#x7684;&#x5173;&#x7A0E;</strong>&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x5305;&#x62EC;iPhone&#x7B49;&#x5728;&#x4E2D;&#x56FD;&#x7EC4;&#x88C5;&#x7684;&#x672C;&#x571F;&#x4EA7;&#x54C1;&#xFF0C;&#x6446;&#x51FA;&#x4E86;&#x4E00;&#x526F;&#x5927;&#x6253;&#x8D38;&#x6613;&#x6218;&#x7684;&#x6837;&#x5B50;&#x3002;&#x8FD9;&#x4E9B;&#x5728;&#x7ADE;&#x9009;&#x65F6;&#x8425;&#x9020;&#x6C14;&#x6C1B;&#x786E;&#x5B9E;&#x7BA1;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x83AB;&#x540D;&#x5176;&#x5999;&#x9009;&#x4E0A;&#x603B;&#x7EDF;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x770B;&#x7279;&#x6717;&#x666E;&#x662F;&#x4E0D;&#x662F;&#x6562;&#x8D70;&#x51FA;&#x8FD9;&#x6B65;&#x68CB;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x7684;&#x5B9E;&#x65BD;&#xFF0C;&#x90A3;&#x4E48;&#x82F9;&#x679C;&#x60F3;&#x4E0D;&#x56DE;&#x7F8E;&#x56FD;&#x4E5F;&#x4E0D;&#x884C;&#x4E86;&#x3002;</p><span> </span><p>&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FDD;&#x80CC;&#x5E02;&#x573A;&#x89C4;&#x5F8B;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x9009;&#x62E9;&#x4E00;&#x5B9A;&#x662F;&#x7528;&#x811A;&#x6295;&#x7968;&#x3002;&#x82F9;&#x679C;&#x8DD1;&#x56DE;&#x7F8E;&#x56FD;&#xFF0C;&#x5BF9;&#x4E2D;&#x56FD;&#x7684;&#x624B;&#x673A;&#x4F01;&#x4E1A;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x53CD;&#x800C;&#x662F;&#x5411;&#x5168;&#x7403;&#x8FDB;&#x519B;&#x7684;&#x5927;&#x597D;&#x65F6;&#x673A;&#x3002;</p><span> </span><p>&#x3010;&#x672C;&#x6587;&#x4E3A;51CTO&#x4E13;&#x680F;&#x201C;&#x4E00;&#x6591;&#x201D;&#x539F;&#x521B;&#x7A3F;&#x4EF6;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x8054;&#x7CFB;&#x539F;&#x4F5C;&#x8005;(&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A;yiban51CTO)&#x3011;</p><span> </span><p><a href="http://s2.51cto.com/wyfs02/M00/87/DD/wKioL1fjnPayEtfWAADqjY536K8916.jpg" target="_blank"><img alt="" src="http://s2.51cto.com/wyfs02/M00/87/DD/wKioL1fjnPayEtfWAADqjY536K8916.jpg"></a></p><p>&#x3010;&#x7F16;&#x8F91;&#x63A8;&#x8350;&#x3011;</p><div><span>&#x3010;&#x8D23;&#x4EFB;&#x7F16;&#x8F91;&#xFF1A;</span><a href="mailto:zhanghao@51cto.com" target="_blank">IT&#x75AF;</a><span> TEL&#xFF1A;&#xFF08;010&#xFF09;68476606&#x3011;</span></div><br><span> </span><a href="http://zhuanlan.51cto.com/###" target="_blank">&#x70B9;&#x8D5E; <span>0</span></a><span> </span></div><span> </span><div><span> </span><span> </span><dl> <em>&#x5206;&#x4EAB;:</em> </dl><span> </span></div><span> </span><span> </span><span> </span></div>